{
    "data": {
        "key": "avant",
        "name": "Avant",
        "author": {
            "name": "Jonathan Miller",
            "headImg": "/data/blogs/img/jonathan_miller.jpg",
            "desc": "John Ulzheimer is a specialist using a credit card announcing, credit scoring, and wholesale fraud. The writer of four books regarding the matter, Ulzheimer has been highlighted a huge number of times in news sources including the Wall Street Journal, NBC Nightly News, New York Times, CNBC, and endless others."
        },
        "date": "Apr.15,2021",
        "preface": "<p>Avant personal loans are a great option for consumers that need to consolidate debt or make home improvements. With an online application, competitive interest rates, and a simple process, many consumers prefer Avant personal loans over any competitors.</p><p><br/></p><p>Read our Avant personal loan review below to see if Avant is right for you.</p>",
        "overview": "<p>Avant offers a user-friendly process that you do completely online. Completing the application takes just minutes and you’ll have an answer quickly. If approved, you can have funds as fast as the next day, which can be great if you are faced with an emergency. With customer service available 7 days a week, you can apply for the loan on any day and get answers to your questions right away.</p><p><br/></p><p>Consumers use Avant personal loans for some of the following reasons:</p><p><br/></p><p><table><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;\"><ul style=\"box-sizing: border-box;list-style: disc; \" class=\" list-paddingleft-2\"><li><p>Consolidate debt</p></li><li><p>Pay for unforeseen emergencies</p></li><li><p>Make home improvements</p></li></ul></td></tr></tbody></table><br/></p><p>Of course, each person has their own reason for needing a personal loan. Avant doesn’t discriminate based on the reason you need the funds – they base your approval on your qualifying factors only.</p>",
        "loan_account": "",
        "apr": "",
        "minimum_credit_score": "",
        "requirements": "",
        "loan_terms": "",
        "pros_cons": {
            "top": "",
            "bottom": "",
            "pros": [
                {
                    "text": "You don’t need perfect credit. Avant offers loans to consumers with a credit score as low as 600, which in the lending industry is considered ‘fair’ credit."
                },
                {
                    "text": "Avant doesn’t charge a prepayment penalty. You are free to make extra payments whenever you want or even pay off the balance in full before its maturity date. You can make additional payments, by selecting ‘additional payments’ on your Avant dashboard."
                },
                {
                    "text": "You may get next day funding. If you obtain approval for an Avant personal loan by 4:30 PM CT Monday – Friday, you may receive funds the next day. This means your loan proceeds will hit your checking account or other linked account by the next business day."
                },
                {
                    "text": "The payments are fixed. You don’t have to worry about adjusting interest rates that create unpredictable payment amounts. This makes it easier to budget your finances monthly and make your payments on time."
                },
                {
                    "text": "Customer service hours are convenient. If you need help with your loan application, support is available 7 days a week 7 AM to 8 PM CT. Once you have an Avant personal loan, customer service is available 7 AM to 10 PM Monday – Friday and Saturday – Sunday 7 AM – 8 PM."
                },
                {
                    "text": "You can set up auto-pay or use the Avant app for easy access. Setting up autopay ensures that you don’t miss a payment. If you prefer to make payments, yourself, you can do so via your dashboard online or in the Avant mobile app."
                }
            ],
            "cons": [
                {
                    "text": "Avant charges an origination fee. Avant deducts the fee right from your loan proceeds. This decreases the amount of money you receive in your bank account and it can be as high as 4.75% of the loan amount."
                },
                {
                    "text": "Avant isn’t transparent about the other qualifying requirements. Avant provides vague details regarding what it takes to qualify for a loan aside from the minimum 600 credit score requirement."
                },
                {
                    "text": "Avant conducts a hard credit report inquiry when you apply for a loan. You can check your rates first without affecting your credit score. But, if you apply for a loan, Avant pulls your credit and the inquiry affects your credit score immediately."
                }
            ]
        },
        "applying": "<p>Applying for an Avant personal loan is simple. Choose ‘Check Your Loan Options’ and complete the online application. You’ll need the following information:</p><p><br/></p><p><table><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;\"><ul style=\"box-sizing: border-box; list-style: disc; \" class=\" list-paddingleft-2\"><li><p>Name</p></li><li><p>Address</p></li><li><p>Whether you rent or own your home</p></li><li><p>The amount of your monthly housing payment</p></li><li><p>Years at your current address</p></li><li><p>Birthdate</p></li><li><p>Contact information (email and phone number)</p></li><li><p>Social Security number</p></li><li><p>Type and amount of monthly income</p></li><li><p>The reason you need the loan</p></li><li><p>The amount that you need</p></li><li><p>Your credit score rating (estimated)</p></li><li><p>Code on any mailers or preapprovals you received (optional)</p></li></ul></td></tr></tbody></table><br/></p><p>Once you hit ‘submit’ you’ll be presented with loan offers. This step does not affect your credit score. Anyone can do this step. You look at your offers and decide if you want to move forward with any of them.</p><p><br/></p><p>Look closely at the loan amount, term, and APR. Also, look at the origination fee. Once you choose a loan option, you’ll move forward with the loan process. It’s not until you select a loan option that Avant does a ‘hard pull’ on your credit report. This means that you actively apply for the loan and intend to borrow the money.</p><p><br/></p><p>If you have ‘bad’ credit, you still use the same process. Before you apply for the loan, though, make sure you have other ‘compensating factors.’ Avant needs a reason to think of you as a ‘worthy borrower.’ In other words, they look for:</p><p><br/></p><p><table><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;\"><ul style=\"box-sizing: border-box; list-style: disc; \" class=\" list-paddingleft-2\"><li><p>Long-term and stable employment</p></li><li><p>Low debt ratio (few outstanding debts compared to your income before taxes)</p></li><li><p>Adequate reserves on hand (liquid assets, such as a checking or savings account)</p></li></ul></td></tr></tbody></table><br/></p><p>Avant looks at each case individually. There isn’t one credit score that they will automatically deny or one reason they will automatically approve a borrower. They look at the big picture to decide your likelihood of paying the loan back on time before making a decision.</p>",
        "have_bad_credit": "",
        "main_loan_features": "<ul style=\"list-style: disc;\"><li><p>Avant personal loans are all fixed-rate personal loans. This means the rate they offer you when you apply for the loan is the only rate you’ll pay. For example, if you secure a loan with a 10% interest rate, you pay 10% each month until you pay the loan in full.</p><p><br/></p></li><li><p>Avant offers loan amounts from $2,000 - $35,000. You’ll need great qualifying factors to secure the maximum loan amount. If you have a credit score closer to Avant’s minimum credit score requirement, you’ll likely get an offer for a lower loan amount. This is also the case if you have a high debt ratio (a large amount of your income covers existing debt). Avant wants to make sure you can easily repay your debt.</p><p><br/></p></li><li><p>Avant offers loan terms between 24 and 60 months. The shorter the term that you choose, the lower the APR Avant charges. They base the APR on the length of time you’ll have their money outstanding. A borrower that pays the loan back in two years gives Avant a chance to loan the money to another consumer and make more money sooner than a borrower that needs the full five years to pay the loan back in full.</p><p><br/></p></li><li><p>You can prepay the loan at any time. Prepayment penalties are common with personal loans. Banks don’t want you to prepay the loan because it cuts at the interest they make on the loan. The faster you pay the principal balance back, the less interest you owe. Many banks make up for this risk by charging a prepayment penalty. In other words, they make up for the interest you won’t pay by preparing the loan. Avant doesn’t charge a prepayment penalty though – you are free to repay the loan whenever you are able to do so.</p></li></ul><p><br/></p>",
        "rates_fees": "<p>The rates and fees you pay on a personal loan are important. Because personal loans are unsecured (there’s no collateral), lenders don’t have anything to hold onto should you not make your payments. Because of this, the rates and fees on personal loans are often much higher than secured loans. Avant offers competitive rates and fees, though, making it affordable for consumers to secure the funding they require.</p>",
        "loan_process": "<table><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;\"><ul style=\"box-sizing: border-box; list-style: disc;\" class=\" list-paddingleft-2\"><li><p>The loan process with Avant is simple. You start by completing the online application. Once you choose an offer, you’ll go through the Verification Process, which includes:</p><p><br/></p></li><li><p>Identity verification – Typically, borrowers go through an electronic knowledge-based authentication. The system will ask you questions about your financial past that only you should have the answers to. If you answer the questions correctly, the system identifies you.</p><p><br/></p></li><li><p>Income verification – Avant originators must verify your income. They will try using their online verification tool, which is an automated system that checks the validity of the information you provided. If they can’t verify your income using this tool, the originator may reach out and ask for copies of your paystubs and W-2s for the last two years.</p><p><br/></p></li><li><p>Employment verification – Oftentimes, originators must call your employer strictly to verify your employment dates. They don’t divulge to your employer why they are calling. They simply ask about your dates of employment</p><p><br/></p></li><li><p>Verifying self-employment – If you work for yourself, you’ll need to provide Avant with your last two years’ of tax returns, a tax transcript, and a letter from your tax preparer, if you have one.</p><p><br/></p></li><li><p>Verifying your bank account – You must also have a valid checking or savings account that you can link to your Avant account. This is the account you’ll receive your loan proceeds. Avant originators may also use this information to verify your income deposits as another way to verify your income.</p></li></ul></td></tr></tbody></table><p><br/></p>",
        "customer_support": "<p>Avant offers superior customer support which is available via email or phone. You can email Avant 24/7 and their phone support is available:<br/></p><p><br/></p><p><table><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;\"><ul style=\"box-sizing: border-box; list-style: disc;\" class=\" list-paddingleft-2\"><li><p>Monday – Friday 7 AM – 10 PM</p></li><li><p>Saturday – Sunday 7 AM – 8 PM</p></li></ul></td></tr></tbody></table><br/></p>",
        "bottom_line": "<p>If you are unable to secure a personal loan from your local bank, Avant personal loans offer a great alternative. Typically the following consumers benefit the most:</p><p><br/></p><p><table><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;\"><ul style=\"box-sizing: border-box; \" class=\" list-paddingleft-2\"><li><p>Borrowers with less than perfect credit – Banks typically require high credit scores. If you don’t have perfect credit and know your score is near the 600 range, Avant makes a great option.</p><p><br/></p></li><li><p>Borrowers that need funds fast – If you need your funds as fast as tomorrow, Avant offers fast disbursements to qualified borrowers.</p><p><br/></p></li><li><p>Borrowers that don’t mind an origination fee – You’ll pay as much as 4.75% on your Avant personal loan, so make sure you’re okay with that cost before applying for the loan.</p></li></ul></td></tr></tbody></table><br/></p><p>Avant offers a great way to get funds you need fast. With fixed interest rates, transparent fees, and no prepayment penalty, it’s a viable alternative for anyone looking for a personal loan.</p>"
    }
}