{
    "data": {
        "key": "drcredit",
        "name": "DRCREDIT",
        "author": {
            "name": "Jessica Cotzin",
            "headImg": "/data/blogs/img/jessica.webp",
            "desc": "Jessica Cotzin is our resident small business and personal loans whiz. She is a skilled writer with a bachelor’s in journalism from Florida Atlantic University, providing information to her readers on the loans industry and personal finance."
        },
        "date": "Apr.18,2021",
        "preface": "<p>If you have bad credit, you may think you’ll never get a personal loan. While it’s true most lenders want good credit to give you a personal loan, there are options out there for bad credit personal loans, especially when you use a platform like Dr. Credit.</p><p><br></p><p>Check out our review on Dr. Credit to see if it’s your path to a personal loan despite your bad credit.</p>",
        "overview": "<p>Dr. Credit is an online marketplace that matches you with lenders offering personal loans to anyone, including people with bad credit. They cater to people who have suffered financial distress and are trying to pick up the pieces.</p><p><br/></p><p>It’s a nice change from most lenders who want perfect credit yet don’t provide the chance to build that credit again. Dr. Credit works with lenders who keep their interest rates affordable while helping consumers with bad credit get the loan they need and the opportunity to build their credit up again.</p><p><br/></p><p>Dr. Credit doesn’t underwrite, fund, or approve loans. They are strictly the marketplace that brings together borrowers looking for a loan and lenders with the programs borrowers with bad credit need.</p>",
        "loan_account": "",
        "apr": "",
        "minimum_credit_score": "",
        "requirements": "<p>Dr. Credit caters to borrowers with bad credit, so the qualifying requirements aren’t nearly as tough as you’d find with other lenders. Because Dr. Credit is a marketplace, you’ll have a variety of lenders to choose from and each lender has different requirements.</p><p><br/></p><p>Before you apply for a personal loan, whether secured or unsecured, it’s always a good idea to check your credit. Even if you know you have bad credit, there are a few ways you can boost it slightly so you get better rates and terms from the bad credit lenders.</p><p><br/></p><p>Grab a free copy of your credit report and see what you need to fix. Here are a few ways to boost your credit score:</p><p><br/></p><ul style=\"list-style: disc;\"><li><p>Bring your late payments current – Any late payments you see reported on your credit report, bring current as quickly as you can. A late payment hurts your credit score the most. If you have 30, 60, or 90 day late payments, work with your lender to get them caught up again and then stay current on your payments.</p></li></ul><p><br/></p><ul style=\"list-style: disc;\"><li><p>Don’t overextend your credit – You shouldn’t have more than 30% of your credit line outstanding at one time. This hurts your credit score too. If you notice you have high credit card balances, try paying them down, or use your Dr. Credit personal loan to consolidate the debt, which will improve your credit.&nbsp;</p></li></ul><p><br/></p><ul style=\"list-style: disc;\"><li><p>Take care of collections – If you have any collections or public records, take care of them as quickly as possible. Make sure when you work with the creditor that you ask for them to delete the collection from your credit report when you satisfy it so your credit score can recover.</p></li></ul><p><br/></p><p>When you’re applying for a personal loan with bad credit, you need to supply lenders with other compensating factors. They need a reason to take a risk on your loan. Even if your credit is bad, you can make up for it in these areas:</p><p><br/></p><ul style=\"list-style: disc;\"><li><p>Stable employment – If you’ve been at your job for over 2 years, lenders use that as a compensating factor. It shows that you’re consistent and reliable, which is a key factor when approving you for a personal loan.</p></li></ul><p><br/></p><ul style=\"list-style: disc;\"><li><p>Liquid assets on hand – If you have any assets, share this information with the personal loan lender. Any money you have on hand that you can prove may increase your chances of approval. Liquid assets are money in checking, savings, stocks, bonds, and even CDs.</p></li></ul><p><br/></p><ul style=\"list-style: disc;\"><li><p>No recent credit inquiries – If you show that you aren’t ‘desperate’ for money, but want the personal loan for bad credit to get you back on your feet, you’ll have a higher chance of approval. If you have too many inquiries, it looks like you’re desperate for money and lenders won’t approve you.</p></li></ul>",
        "loan_terms": "",
        "pros_cons": {
            "top": "",
            "bottom": "",
            "pros": [
                {
                    "text": "You have many options with a large variety of lenders to choose from"
                },
                {
                    "text": "You don’t need perfect credit; you can even get a loan with bad credit"
                },
                {
                    "text": "Dr. Credit doesn’t charge any fees to match you with a lender"
                },
                {
                    "text": "You may apply for a secured or unsecured loan depending on your needs"
                },
                {
                    "text": "You can apply for a personal loan for bad credit for any purpose"
                }
            ],
            "cons": [
                {
                    "text": "You’ll likely pay APRs higher than someone with good credit would pay"
                },
                {
                    "text": "Most lenders for borrowers with bad credit charge high fees"
                },
                {
                    "text": "Dr. Credit isn’t transparent about the options the lenders offer; you have to apply to find out"
                }
            ]
        },
        "applying": "",
        "have_bad_credit": "",
        "main_loan_features": "<p>All personal loans have different terms, rates, and fine print. It’s important to talk to the lender you choose and learn all about the personal loan for bad credit they are offering you. The key areas to talk about are the rates and fees, loan process, and term.</p><p><br/></p><p>Dr. Credit lenders have a variety of rates, terms, and fees depending on your qualifying factors and the loan you choose.</p>",
        "rates_fees": "<p>Most Dr. Credit personal loan lenders charge upfront fees for their loans. When you have bad credit, lenders take a risk in lending to you. To make up for this risk, they charge upfront fees to make sure they make money even if you default.</p><p><br/></p><p>Before you sign on the dotted line, ask about the fees and make sure it makes sense to take the loan. The good news is you don’t have to pay for the upfront fees out of pocket, but the bad news is they deduct the fee from the amount you receive from the loan proceeds.</p><p><br/></p><p>Dr. Credit lender’s rates vary by lender too. Lenders determine your APR by looking at your:</p><p><br/></p><ul style=\"list-style: disc;\"><li><p>Qualifying Factors – Even though you have bad credit, lenders look at other factors including your debt-to-income ratio, employment history, and reserves. The more compensating factors you have to make up for your bad credit, the lower the APR the lender will offer.</p></li></ul><p><br/></p><ul style=\"list-style: disc;\"><li><p>Loan amount – The less money you borrow, the lower the APR. Dr. Credit lenders loan as much as $25,000, but borrowing that much will leave you with a higher APR than if you took a loan for $5,000 for example.</p></li></ul><p><br/></p><ul style=\"list-style: disc;\"><li><p>Reason you’re borrowing money – If you’re borrowing money to fix up your home, you may get lower APRs because you’re reinvesting in an asset. If, however, you need the money to consolidate credit card debt or pay for an emergency expense, you may get a higher APR because there’s more risk in securing repayment from you.&nbsp;</p></li></ul>",
        "loan_process": "<p>Dr. Credit makes it simple to get a personal loan for bad credit. You complete one application, but may receive offers from multiple lenders. The application itself takes only a couple of minutes. After you answer the questions. Dr. Credit matches you with lenders based on the information you provided.</p><p><br/></p><p>Again, Dr. Credit doesn’t underwrite or fund loans. They are simply the middle-man between you and the lender. They provide the platform to bring you both together so you can get the financing that you need.</p><p><br/></p><p>Within a few minutes, you’ll receive offers from its partner lenders. The lenders will offer you a loan amount, rate, and term. You can compare your offers side-by-side to see which one offers the best rate and term for your situation.</p><p><br/></p><p>As always, read the fine print and ask questions if you don’t understand. Make sure you understand the fees and ask about changing some of the numbers around to see what other offers you can get.</p><p><br/></p><p>For example, if you want a lower APR, see what lowering the loan amount does for you – it may lower your APR to the level you wanted.</p><p><br/></p><p>Once you’re done playing with the numbers, you choose the lender and offer you like and you work directly with the lender. The lender will likely ask for documentation to prove the information you provided. From there, most lenders fund the loan within a matter of days. </p>",
        "customer_support": "<p>Because Dr. Credit isn’t the lender, they can’t answer any questions about your loan or the application itself. But if you have general questions about the platform and how it works, you can reach Dr. Credit via email or phone at 1-855-657-5822.</p>",
        "bottom_line": "<p>If you have bad credit and need a personal loan, Dr. Credit may be the right platform for you. Like with any loan, read the fine print and know what you’re getting before you close on the loan. Don’t take the first loan offers sent to you, but compare all your options side-by-side.</p><p><br/></p><p>Dr. Credit makes applying for loans with multiple lenders easy with one loan application and the ability to secure offers from many lenders within a matter of minutes. Use the platform for what it’s worth and find the loan that works the best for you and your financial situation.</p>"
    }
}