{
    "data": {
        "key": "lendingtree",
        "name": "LendingTree",
        "author": {
            "name": "Jessica Cotzin",
            "headImg": "/data/blogs/img/jessica.jpg",
            "desc": "Jessica Cotzin is an essayist and the expert on independent ventures and individual credits. She has been expounding on individual budget and the advances business for various years, and holds a four year college education in reporting from Florida Atlantic University."
        },
        "date": "Apr.19,2021",
        "preface": "<p>When you’re shopping for a personal loan, LendingTree should be on your short list of places to shop. In a few minutes and after answering a few simple questions, you can have a variety of loan options at your fingertips.</p><p><br></p><p>LendingTree offers personal loans for a variety of reasons and has a large network of lenders that cater to borrowers with various qualifying factors.</p><p><br></p><p>Are you curious about how LendingTree can help you get a loan? Keep reading to see how they stack up.</p>",
        "overview": "<p>LendingTree is an online loan marketplace. They network with more than 1,500 lenders that offer loans that consumers need. They provide the platform for lenders and consumers to come together with one easy application.</p><p><br/></p><p>Consumers complete one loan application and are able to obtain quotes from several lenders in one place. You get an answer within minutes, obtaining offers from lenders that offer loans that meet your criteria and loan qualifications. The offers you receive aren’t a commitment to lend, but rather an offer to learn more.</p><p><br/></p><p>LendingTree isn’t a lender. They don’t underwrite your loan or fund it. Instead, they work as the ‘middleman’ between you and the lenders. Once you choose a lender to work with, all communication and exchange of documentation will go directly through the lender. LendingTree only gathers your information and serves as the ‘marketing company’ to bring you and the lender together.</p>",
        "loan_account": "<p>Most LendingTree lenders offer personal loans in amounts ranging from $1,000 to $50,000 but you may find a few lenders that offer slightly higher amounts. If you have great qualifying factors, such as a high credit score, low debt ratio, and stable income, you may qualify for more.</p>",
        "apr": "<p>Personal loans are unsecured. This means you don’t have to put collateral down on them. This also makes them riskier loans for lenders because you won’t lose anything personal if you don’t pay your loan.</p><p><br></p><p>Because of this risk personal loans often have higher APRS. Lenders need to make sure they’re protected in the event that you default on your loan.</p><p><br></p><p>LendingTree borrowers with great credit scores often find rates around 10.19%, whereas borrowers with credit scores between 580 – 679 find rates as high as 24.98%. The interest rate you receive depends on your credit score, debt ratio, and income. These rates are pretty standard for unsecured personal loans.</p>",
        "minimum_credit_score": "<p>Most LendingTree lenders allow credit scores as low as 640, but again, you pay the higher APR to make up for the risk. Borrowers with great credit (over 800) get the lowest APRs, whereas borrowers with average credit (670 – 739) get average interest rates. Because you are shopping around, though, it’s often easier to negotiate with lenders to get a lower APR.</p>",
        "requirements": "",
        "loan_terms": "<p>LendingTree lenders offer loans starting at just one year all the way up to 180 months (15 years). The longer that you borrow the funds, though, the higher the APR you’ll pay. Because you borrow the money for the long-term, you’ll not only pay a higher interest rate, but more interest over the life of the loan.</p><p><br/></p><p>Don’t focus on the interest rate alone, but also on the total cost of interest over the life of the loan. If you borrow money for as long as 12 years, for example, you’ll pay interest every month for 12 years – that interest can really add to the cost of what you borrowed.</p>",
        "pros_cons": {
            "top": "<p>LendingTree has a great reputation, but every lender has its pros and cons, check them out below.</p><p><br/></p>",
            "bottom": "",
            "pros": [
                {
                    "text": "You only have to complete one application. This makes it much easier to shop around for a loan. When you don’t have to call multiple lenders or complete multiple applications, you can save time and effort. Within minutes you’ll know which lenders offer a program for you."
                },
                {
                    "text": "LendingTree doesn’t charge a fee. Their service is completely free for borrowers. If you do close on a loan with a LendingTree lender, that lender pays LendingTree a commission."
                },
                {
                    "text": "You can negotiate with lenders, especially when you have multiple offers in front of you. Lenders will compete for your business by lowering the fees and/or rates in some cases. This works best if you have great credit and a low debt ratio."
                },
                {
                    "text": "LendingTree offers a variety of tools and services (free of charge) to help you make the most of your personal finances. Their tools include mortgage calculators, debt-relief options, and advice regarding your personal finances."
                },
                {
                    "text": "LendingTree doesn’t do a hard credit pull when you apply for a loan. This means your credit score won’t drop as you shop around for the right loan."
                }
            ],
            "cons": [
                {
                    "text": "In order to secure quotes from any lenders, you have to divulge quite a bit of personal information. Lenders do a ‘soft credit pull’ that allows them to make a determination on your application. Once you choose a lender, you have to give your information all over again to complete their formal application."
                },
                {
                    "text": "LendingTree may sell your information to third parties. The fine print on their disclosures says that they are a ‘Marketing Lead Generator.’ You may receive future telemarketing calls or emails trying to enlist your business."
                },
                {
                    "text": "While LendingTree does feature thousands of lenders on its site, it’s not all-inclusive. If you have an odd financial situation, you may not find a lender that suits your needs, which means you’d have to apply for another loan elsewhere and go through the process again."
                },
                {
                    "text": "Even if you receive a loan offer, that’s not a guarantee of approval. You still have to work with the lender and go through the approval process. There is no guarantee until you physically have the funds in your hands."
                }
            ]
        },
        "applying": "<p>The application process is simple. You answer some basic questions about yourself and your finances online. You do have to divulge pretty personal information, but that’s so the lenders can get a good feel for your situation to decide if they want to compete for your business. The information you’ll provide includes information about your credit score range, your income, assets, employment, and the loan amount you desire.</p><p><br/></p><p>The application itself only takes a few minutes and you should have an answer within a few short minutes as long as you provide accurate information. Remember that lenders will verify the information you provide by pulling your credit report and verifying any other qualifying information by asking for documentation to prove it.</p>",
        "have_bad_credit": "<p>If you have less than perfect credit, LendingTree is one of the best places to try and get a loan. With thousands of lenders to choose from, you have a higher chance of getting matched with a lender that accepts lower credit scores.</p><p><br/></p><p>On average, LendingTree lenders want a 640 credit score or higher, but the occasional lender will slip through and offer you a loan. Just be prepared to pay higher fees and/or interest rates on your loan. Lenders base the fees and APRs on your credit score as well as your other qualifying factors. With bad credit, though, it’s almost a guarantee that you’ll be quoted much higher interest rates than borrowers with good credit.</p>",
        "main_loan_features": "<p>LendingTree matches you with lenders that offer personal loans for a variety of reasons including:</p><p><br/></p><table class=\"table\" style=\"width: 100%;\"><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;  border-top-color: rgb(222, 226, 230);\"><ul style=\"box-sizing: border-box; list-style: disc;\" class=\" list-paddingleft-2\"><li><p>Home improvement</p></li><li><p>Car Repairs</p></li><li><p>Credit card consolidation</p></li><li><p>Large purchases</p></li><li><p>Wedding expenses</p></li><li><p>Medical expenses</p></li><li><p>Moving expenses</p></li><li><p>Emergencies</p></li></ul></td></tr></tbody></table>",
        "rates_fees": "<p>LendingTree lenders offer interest rates starting at 3.99% up to 35.99%. Borrowers with the best credit scores and lowest debt ratios get the best rates.</p><p><br/></p><p>Other fees to watch for include:</p><p><br/></p><table class=\"table\" style=\"width: 100%;\"><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;  border-top-color: rgb(222, 226, 230);\"><ul style=\"box-sizing: border-box; list-style: disc;\" class=\" list-paddingleft-2\"><li><p>Origination fees – Some lenders do charge origination fees. These fees are separate from the APR and come right off the top of your loan amount. For example, if a lender charges a 1% origination fee and you borrow $20,000, they will take the $200 right from your loan amount, leaving you with $19,800.</p></li><li><p>Prepayment penalties – Some lenders charge a prepayment penalty. This only goes into effect if you pay the loan off in full early. Read the fine print on the loan documents to find out if your loan has one and how much it will cost. Lenders typically charge a percentage of your loan amount if you pay it off earlier than they’d prefer.</p></li></ul></td></tr></tbody></table>",
        "loan_process": "<p>LendingTree makes the loan process simple:</p><p><br/></p><p><table class=\"table\" style=\"width: 100%;\"><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;  border-top-color: rgb(222, 226, 230);\"><ul style=\"box-sizing: border-box; list-style: disc;\" class=\" list-paddingleft-2\"><li><p>You answer a series of questions on the LendingTree screeners. The questions ask you about your personal and financial information so that they can match you with lenders.</p></li><li><p>After you complete the application, LendingTree sends you offer from its member lenders. The offers will include the basic details about the loan.</p></li><li><p>You can compare the loan offers side-by-side, paying close attention to the APR, fees, and loan terms.</p></li><li><p>Choose a lender and move forward with the process with them.</p></li></ul></td></tr></tbody></table><br/></p><p>Once you choose a lender, your work with LendingTree is complete. You communicate directly with the lender. They will request documentation from you in order to process your loan. They will also conduct a hard pull on your credit report to ensure that you qualify for the loan.</p><p><br/></p><p>Most lenders are able to fund your loan within a few business days as long as you provide the information they require.</p>",
        "customer_support": "<p>LendingTree offers multiple ways to contact customer support.</p><p><br/></p><p>Via phone – 800-813-4620 Monday – Thursday 8 AM – 9 PM EST; Friday 8 AM – 8 PM EST; and Saturday 10 AM – 7 PM EST</p><p><br/></p><p>You can also find answers to commonly asked questions on<nuxt-link to=\"/lendingtree\">LendingTree’s Contact Us webpage.</nuxt-link></p><p><br/></p><p>LendingTree offers the opportunity to comparison shop for a personal loan without dealing with the headache of shopping around and completing multiple applications. While you’ll still have to talk to multiple lenders as you make your decisions, the work is done for you and the lenders compete for your business rather than the other way around.</p>"
    }
}