{
    "data": {
        "key": "marcus",
        "name": "Marcus",
        "author": {
            "name": "John Ulzheimer",
            "headImg": "/data/blogs/img/john.webp",
            "desc": "As a specialist in credit scoring, credit reporting and identity theft, John Ulzheimer has lent his expertise to the four financial books he authored. He’s been invited as an expert guest on myriad news outlets, like the Wall Street Journal, NBC Nightly News, New York Times and CNBC, among others."
        },
        "date": "Feb.07,2021",
        "preface": "<p>If you have good to excellent credit, a personal loan for Marcus by Goldman Sachs may be a good fit when you need money. Whether you need funds to pay off high interest credit card debt, or consolidate other consumer debts, a Marcus personal loan may be a good option.</p><p><br/></p><p>Marcus by Goldman Sachs is the online branch of Goldman Sachs and provides consumer lending products including unsecured personal loans. Consumers with good or excellent credit can enjoy a personal loan with no collateral required and no fees. It’s one of the easiest loans to get and Marcus customers agree.</p><p><br/></p><p>Borrowers love the speed Marcus operates,You could receive your funds in as little as 3 days, and its quality customer service is apparent with its BBB (A+) rating. Borrowers rave about most things about the Marcus personal loan, but like all loans, there are good and bad sides.</p><p><br/></p><p>Check out our Marcus by Goldman Sachs personal loan review below.</p>",
        "overview": "",
        "loan_account": "",
        "apr": "",
        "minimum_credit_score": "",
        "requirements": "<p>Like we said earlier, Marcus requires great credit scores to qualify for their loans. This means a  minimum 660 FICO score. If you have higher scores, though, you increase your chances of getting an even lower APR.</p><p><br/></p><ul style=\"list-style:disc;\"><li>Be a US citizen</li><li>Age Requirement: 18 (19 in Alabama, 21 in Mississippi and Puerto Rico)</li><li>Have a valid Social Security number</li><li>Have a valid checking account</li></ul><p>Besides the above requirements, you must also:</p><p><br/></p><p>Marcus uses your social security number to pull your credit, which is how they decide if you’re a good risk for the loan. They require a checking account because that’s how they fund your loan – they send the funds direct deposit to your checking account.</p><p><br/></p><p>While Marcus has slightly tougher qualifying requirements than other personal loan lenders, they offer lower rates and better terms. It pays to have good credit and solid qualifying factors so you get the best loans.</p><p><br/></p><p>If you’re just shopping around, you don’t have to have a hard inquiry on your credit report. Marcus offers free quotes (a soft pull on your credit report) until you move forward with the loan. In other words, it doesn’t hurt your credit to find out what they would charge you for a loan.</p>",
        "loan_terms": "",
        "pros_cons": {
            "top": "<p>All lenders have a good and bad side. Marcus has a lot of good features, but there are a few downsides you should know.</p>",
            "bottom": "",
            "pros": [
                {
                    "text": " No fees – Marcus personal loans have many benefits, but the lack of fees is one of the best. When they say no fees, they mean no upfront origination fees as well as no late fees or prepayment penalties. If you miss a payment, you must make it up and interest will accrue, but you won’t pay extra fees."
                },
                {
                    "text": "Will pay creditors directly – If you need the Marcus loan to consolidate high interest consumer debt, Marcus will pay your creditors for you. Instead of Marcus giving you the loan proceeds and you paying the creditors, Marcus will pay up to 10 creditors for you. This helps reduce the risk of spending your money before you pay off your intended debts."
                },
                {
                    "text": " Low APRs – Marcus offers some of the lowest APRs in the industry. The APRs start at 6.99% but are reserved for ‘great credit’ borrowers. Even if you don’t have the highest credit score, you may still get an attractive interest rate."
                },
                {
                    "text": "Many loan term options – If you don’t want a standard loan term or you need to stretch the term out a few months to lower the payment, Marcus offers a variety of loan term options besides the standard terms starting at 3 years and up to 6 years. For example, if you need a 39 month term or 66 month term, you can ask for it."
                },
                {
                    "text": "Marcus reports payments to the credit bureaus – Not all personal loan lenders report loan payments to all three credit bureaus. This can hurt your credit if you make your payments on time and need help boosting your score. Marcus reports to all three bureaus, though."
                },
                {
                    "text": "The process is online – Getting a personal loan from your local bank can take weeks and involve a lot of paperwork and phone calls. A personal loan from Marcus requires only an online application and a few uploaded documents to prove your income and assets. "
                },
                {
                    "text": "The mobile app – Marcus has a personal loan app that is great for visualizations of where you stand on your loan. On the app, you can check your loan balance, make payments, check on recently made payments, or manage your autopay selections."
                }
            ],
            "cons": [
                {
                    "text": " Long funding time – Most online lenders fund loans by the next business day if they have everything needed. Marcus doesn’t fund overnight and takes an average of 3 days to fund a loan."
                },
                {
                    "text": "No co-signed loans – Marcus only allows single applicants. This means if you’re married and want your spouse on the loan or you want a co-signer to help with your less than optimal credit, you can’t."
                },
                {
                    "text": "High credit scores required – You need high credit scores to qualify for a Marcus loan or if you don’t, you’ll pay high APRs, as high as 19.99%."
                }
            ]
        },
        "applying": "",
        "have_bad_credit": "",
        "main_loan_features": "<ul style=\"list-style: disc;\"><li>On-time payment reward – The fact that Marcus doesn’t charge late fees is great, but they offer an incentive to make your payments on time with their on-time payment reward. For every 12 months you make your payments on time (in a row), you can defer one monthly payment and not accrue extra interest. It extends your loan term by a month, but if it helps you in a pinch, it could be advantageous.</li><li>The discount rate for auto payments – If you allow Marcus to withdraw your payments automatically each month, they’ll reduce your APR by 0.25% because of the lower risk of default.</li><li> Free quote with soft credit pull – If you’re shopping around and want to check your rates, Marcus offers free quotes that don’t affect your credit. They only do a hard credit pull (affecting your credit score) once you choose them and apply for the loan.</li><li>Fixed APR – All Marcus personal loans have a fixed APR which means your rate never changes. As long as you make your payments on time and don’t refinance the loan, you’ll always know your payment for the entire term.</li><li>Flexible due dates – Marcus sets a due date when you take out the loan, but you can change it if need be. Just contact customer service and ask them to change the date to a date that’s easier for you to pay the loan on time.</li><li>No late fees – We can’t reiterate this enough, especially after how 2020 went down. If you run into financial trouble and can’t make your payment on time, you won’t be charged a late fee. While you shouldn’t get in the habit of paying your loan late, it’s nice to know there’s some flexibility if you miss a due date.</li></ul>",
        "rates_fees": "<p>Marcus is known for its low interest rates. With rates starting at 6.99%, it’s a great place to get financing, especially since you don’t have to put up collateral.’</p><p><br/></p><p>Not everyone is promised the 6.99% rate, though. You need great credit and a low debt-to-income ratio to qualify. If you don’t qualify for the lowest rate, you may get a rate between 6.99% and 19.99%, which is still low for an unsecured loan.</p><p><br/></p><p>Even if you don’t qualify for the lowest rate, Marcus doesn’t charge any fees, which is a savings in and of itself. Origination fees are just prepaid interest, or more interest on top of the interest you pay each month. Since Marcus doesn’t charge them, you could save you a few hundred dollars on interest.</p>",
        "loan_process": "<p>Marcus makes it easy to apply for and process a loan. Here’s the process:</p><p><br/></p><ul style=\"list-style: disc;\"><li>Complete the loan application including all of your personal information</li><li> Marcus provides you with loan options based on your qualifying factors</li><li>Provide your final details including your social security number so they can pull your credit</li><li>Marcus completes the loan processing, including collecting your income and asset documentation.</li></ul><p><br/></p><p>Once you choose Marcus, you finalize the loan process. Marcus takes around 3 days to complete the loan and fund it. Once they’re done, they send the funds directly to your checking account so you have access to them right away.</p>",
        "customer_support": "<p>Customer support is one area Marcus by Goldman Sachs lacks. While you can contact them via phone 7 days a week and they operate outside normal business hours, they don’t offer any other options for customer support, such as online chat or social media channels.</p>",
        "bottom_line": "<p>If you have great credit, Marcus is a great place to get your persona loan. You’ll secure a low APR and have a fixed payment. While other lenders may have APRs that are close to Marcus, most don’t have any fees like Marcus or offer other features such as flexible payment dates, autopay discounts, or a mobile app to manage your account.</p>"
    }
}