{
    "data": {
        "key": "personalloans",
        "name": "Personal Loans",
        "author": {
            "name": "Jessica Cotzin",
            "headImg": "/data/blogs/img/jessica.jpg",
            "desc": "Jessica Cotzin is our resident small business and personal loans whiz. She is a skilled writer with a bachelor’s in journalism from Florida Atlantic University, providing information to her readers on the loans industry and personal finance."
        },
        "date": "Feb.07,2021",
        "preface": "<p>If you wished you could shop around for personal loans without filling out multiple applications or talking to multiple lenders, you can with PersonalLoans.com. This online personal loan portal makes it easy to compare offers from multiple lenders all with one application.</p><p><br/></p><p>Check out our review on PersonalLoans.com to see if it’s right for you.</p>",
        "overview": "<p>PersonalLoans.com is a lead generator or personal loan marketplace. They don’t underwrite or fund the loans. Instead, they bring together borrowers (like you) and lenders in one place. Lenders partner with them to advertise their services and bring in more borrowers, and borrowers use it to get access to multiple offers in one place.</p><p><br/></p><p>It’s a great service for both sides of the transaction. Lenders get access to more borrowers – including borrowers who may have never know about the lender without PersonalLoans.com. Borrowers have access to more lenders and opportunities they may not have had if they applied to lenders individually.</p><p><br/></p><p>Most PersonalLoan.com lenders offer loan amounts from $1,000 - $35,000 and you often receive funds as soon as the next business day after approval. How much you receive, at what APR, and when you receive the funds all varies by lender. </p><p><br/></p><p>Learn how the PersonalLoans.com platform works to get the loan that’s right for you.</p><p>",
        "loan_account": "",
        "apr": "",
        "minimum_credit_score": "",
        "requirements": "<p>Each lender on the PersonalLoans.com platform has different qualifying requirements. You’re always better off maximizing your credit score, ensuring you have stable income/employment, and decreasing your debt load. Personal loan lenders prefer borrowers who aren’t risky. You can improve your chances of approval by:</p><p><br/></p><ul class=\"ul1 list-paddingleft-2\" style=\"list-style: disc;\"><li><p>Maximizing your credit score (more details below)</p></li><li><p>Staying at the same job with stable income for at least 2 years if possible</p></li><p>Paying down excessive consumer debt or consolidating it with your personal loan</p></li><li><p>Avoiding any collections or public records or taking care of them right away if it happens</p></li></ul><p><br/></p><p>The number one driving factor to qualifying for a personal loan and getting the best rates is ensuring your credit score is as high as possible. Obtain a <a href=\"http://www.annualcreditreport.com/\">free copy of your credit report</a> and check for the following:</p><p><br/></p><ul class=\"ul1 list-paddingleft-2\" style=\"list-style: disc;\"><li><p>Late payments – If you paid any bills 30 days or more late, it can hurt your credit score quite a bit. As quickly as you can, bring the payments current. It won’t erase the late payments but will help increase your credit score faster. Keep making your payments on time to avoid any more credit score decreases.</p></li></ul><p><br/></p><ul class=\"ul1 list-paddingleft-2\" style=\"list-style: disc;\"><li><p>Overextended credit – If you have over 30% of your credit line outstanding, try paying the balance down or commit to consolidate it with a personal loan. Your credit utilization rate is the next largest portion of your credit score. Keeping your balance as close to 30% of the credit line as possible is important.</p></li></ul><p><br/></p><ul class=\"ul1 list-paddingleft-2\" style=\"list-style: disc;\"><li><p>Satisfy any issues – If you have collections, public records, or other negative credit reporting, work with the creditor and/or the credit bureaus to fix the issue. The faster you resolve it, the faster your credit score will improve.</p></li></ul>",
        "loan_terms": "",
        "pros_cons": {
            "top": "<p>All loans and financial platforms have pros and cons. Understanding both sides can help you determine if it’s the right choice for you.</p>",
            "bottom": "",
            "pros": [
                {
                    "text": "You have more options from a variety of lenders than you’d have if you applied with each lender yourself"
                },
                {
                    "text": "There are options for borrowers with low, average, and great credit scores, not just perfect credit score borrowers"
                },
                {
                    "text": "The platform is free to use and there’s no obligation to take a loan if you don’t like your options"
                },
                {
                    "text": "PersonalLoans.com offers a variety of loan options including peer-to-peer loans which are good for borrowers with less than perfect credit"
                },
                {
                    "text": "You can compare your options from multiple lenders without committing to any offers"
                }
            ],
            "cons": [
                {
                    "text": "If you have ‘mediocre’ credit you’ll likely get an interest rate that’s higher on the rate spectrum (closer to 35.99%)"
                },
                {
                    "text": "PersonalLoans.com doesn’t have any say in what offers you get – they are only a loan marketplace, not the lender themselves"
                },
                {
                    "text": "You may have to weed through a lot of offers, some that are way off base before you find the offer that suits your needs"
                }
            ]
        },
        "applying": "",
        "have_bad_credit": "",
        "main_loan_features": "<p>All PersonalLoans.com lenders have different loan features and options. The key is to get as many offers as possible and to compare them side-by-side. Look not only at the features or the interest rate but also the big picture. What will the loan cost you over the entire term and can you afford it?</p><p><br/></p><p>Here are the features to consider. </p>",
        "rates_fees": "<p>As we said above, PersonalLoans.com doesn’t sponsor any lender you may receive offers from – each lender sets their own rates and fees. Some charge upfront fees and others don’t. Always ask the lender about fees, both upfront and ongoing before accepting a loan.</p><p><br/></p><p>If you pay upfront fees, you won’t pay them out of pocket. Instead, they come from the loan proceeds which leaves you with less money in hand from the loan. Not all lenders charge upfront fees, though, so compare your offers to see which makes the most sense.</p><p><br/></p><p>PersonalLoans.com lenders also charge different interest rates. Most lenders determine your rate using the following factors:</p><p><br/></p><ul class=\"ul1 list-paddingleft-2\" style=\"list-style: disc;\"><li><p>Credit score – The better your credit score is, the more likely you are to get a lower APR. Try improving your credit score before applying to get the best results.</p></li></ul><p><br/></p><ul class=\"ul1 list-paddingleft-2\" style=\"list-style: disc;\"><li><p>Income and debt ratio – You don’t need to make a certain amount of money, but how you use your money determines what interest rate lenders offer. The more stable your income and the lower your debts, the lower the APR you may receive.</p></li></ul><p><br/></p><ul class=\"ul1 list-paddingleft-2\" style=\"list-style: disc;\"><li><p>Loan amount – The more money you borrow, the riskier it is for lenders. They usually increase your APR accordingly to ensure they make up for the risk of lending to you. If you borrow $5,000 you’ll get a lower APR than if you borrowed $35,000 in most cases.&nbsp;</p></li></ul><p><br/></p><ul class=\"ul1 list-paddingleft-2\" style=\"list-style: disc;\"><li><p>Reason for the loan – If you’re borrowing the money to reinvest in your home, for example, you may get a lower APR than if you borrow the money for debt consolidation. Investing in your home, which is an asset, is a good risk whereas investing in high interest credit card debt can be risky.&nbsp;</p></li></ul>",
        "loan_process": "<p>It’s easy to use PersonalLoans.com and secure loan offers. You only complete one application and can receive offers from multiple lenders including peer-to-peer lenders, banks, and personal loan lenders. PersonalLoans.com doesn’t influence who makes you an offer – everything is done independent of PersonalLoans.com</p><p><br/></p><p>Once you complete the application, you’ll receive offers in a matter of minutes via email. Let the offers come in and compare them side-by-side. Look at the interest rate, fees, and bottom line. Determine how much the loan will cost over its lifetime, not just monthly.</p><p><br/></p><p>For example, sometimes a lower APR comes at a much higher origination cost. If you look at the loan’s total cost, you’ll see which option is right for you. Total up the costs (interest and origination) for the entire term and see which loan offers the lowest cost. </p><p><br/></p><p>Once you choose a loan, you work directly with the chosen lender. PersonalLoans.com doesn’t ask for documentation or any other information – only the lender you work with will determine what you must provide. </p>",
        "customer_support": "<p>PersonalLoans.com representatives cannot answer any questions about your loan itself, but if you have questions or concerns about the platform, you can reach them Monday – Friday 6 AM – 7 PM PST at 1-800-772-2274 or email support@personalloans.com.</p>",
        "bottom_line": "<p>If you’re looking for a great personal loan and don’t want to shop around with lenders individually, PersonalLoans.com can be an easy way to achieve your goal. You can shop with hundreds of lenders, and the PersonalLoans.com platform will match you with the lenders that meet your criteria and vice versa.</p><p><br/></p><p>You aren’t obligated to use any of the lenders or offers provided to you and PersonalLoans.com is completely free. You can accept an offer and work directly with the lender or you can walk away with no loan and not owe a dime.</p><p><br/></p><p>You have nothing to lose to try PersonalLoans.com out to see what type of loan you may be able to get. No matter where you get your loan, check out the bottom line and make sure you can afford the loan both monthly and over its entire term. </p>"
    }
}