{
    "data": {
        "key": "sofi",
        "name": "SoFi",
        "author": {
            "name": "John Ulzheimer",
            "headImg": "/data/blogs/img/john.jpg",
            "desc": "John Ulzheimer is an expert on credit reporting, credit scoring, and identity theft. The author of four books on the subject, Ulzheimer has been featured thousands of times in media outlets including the Wall Street Journal, NBC Nightly News, New York Times, CNBC, and countless others."
        },
        "date": "Apr.22,2021",
        "preface": "<p>If you are looking for a low APR personal loan with no fees, SoFi may be just what you need. This personal loan lender offers attractive rates, doesn’t charge any fees, and they offer many exclusive member benefits. While you do need high credit scores, you are rewarded greatly for your offers.</p><p><br/></p><p>SoFi offers many benefits for their elite members including educational and community events for both personal and professional development. Interestingly enough, SoFi doesn’t focus on credit scores alone – if you have adequate cash flow, SoFi tends to hold that high in their requirements when qualifying you for a loan.</p><p><br/></p><p>If you have a great credit score or think you offer plenty of benefits for a lender to consider you an ‘elite borrower’, you may want to consider SoFi for your personal loan needs.</p><p><br/></p><p>Keep reading to see how SoFi stacks up to see if they’re the right choice for you.</p>",
        "overview": "<p>SoFi calls themselves the finance company ‘that helps you get ahead.’ They pride themselves on their low interest rates, simple experience, and plenty of community benefits. It takes just a few minutes to get started with their application and they promote full transparency throughout the entire process. They always put their members first and are 100% honest from the start.</p><p><br/></p><p>Operating on the ‘What you See is What you Get’ philosophy, you don’t have to worry about hidden fees or unpleasant surprises when working with SoFi. Because SoFi doesn’t have brick-and-mortar locations (all business is done online), they are able to pass along their savings on lower overhead to its customers. With customer support professionals located in California and Utah, they offer support 7 days a week for new and existing customers.</p>",
        "loan_account": "<p>SoFi offers loan amounts starting at $5,000 and up to $100,000. The amount you qualify for depends on your credit score, income, cash flow, and ability to repay the loan payment.</p>",
        "apr": "<p>SoFi offers some of the lowest APRs for personal loans in the industry. This makes sense since they tend to cater to borrowers with excellent credit or large cash flow.</p><p><br/></p><p>SoFi’s interest rates start at 5.99% for the best qualifying borrowers that also choose autopay for their payments. Their APRs do go as high as 19.96%, though.</p>",
        "minimum_credit_score": "<p>As we stated above, SoFi focuses on borrowers with high credit scores. On average, they want you to have at least a 680 credit score to qualify; however, they will take lower scores with other compensating factors. The most commonly accepted compensating factor is a large cash flow as this lowers the risk of you defaulting on your loan.</p>",
        "requirements": "<p>SoFi has a few other qualifying requirements applicants must meet including:</p><p><br/></p><p><table class=\"table\" style=\"width: 100%;\"><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;  border-top-color: rgb(222, 226, 230);\"><ul style=\"box-sizing: border-box;list-style: disc;\" class=\" list-paddingleft-2\"><li><p>You must be at least 18 years old</p></li><li><p>You must be a US citizen</p></li><li><p>You must live in a state where SoFi is licensed to lend</p></li><li><p>You must be employed and make sufficient income</p></li><li><p>If you have an offer of employment, your start date must be within the next 90 days</p></li></ul></td></tr></tbody></table><br/></p><p>If you have a current SoFi loan, you must have made at least three payments on it before applying for another loan and those payments must have been on time.</p>",
        "loan_terms": "<p>SoFi offers loan terms starting at 2 years up to 7 years. While a longer term will help keep your payment down and may possibly help you borrow more money, you’ll pay more interest over the life of the loan. The shorter the term that you choose, the less interest you’ll pay because you’ll pay the interest back to the lender faster.</p>",
        "pros_cons": {
            "top": "<p>SoFi offers lenders a unique experience that many tend to think as ‘elite.’ However, just like any lender, there are pros and cons to using SoFi.</p><p><br/></p>",
            "bottom": "",
            "pros": [
                {
                    "text": "SoFi offers member-only networking events. They take pride in caring for the whole borrower – not just looking at you as a dollar sign. They invest themselves in helping their borrower better their personal and professional lives."
                },
                {
                    "text": "Even though they say they want ‘high’ credit scores, they often look at other factors more to determine if you qualify for a loan. If you have a lower credit score, but great cash flow, for example, you may be a good candidate."
                },
                {
                    "text": "SoFi offers some of the lowest interest rates in the industry as well as some of the highest loan amount maximums. Of course, you must be able to qualify for the rates and loan amount, but many lenders don’t even offer this option."
                },
                {
                    "text": "You can choose a variable rate if you choose to do so. While a fixed rate is more predictable and common, SoFi does give borrowers the option to choose a variable rate which is good for those with varying income or that want to take advantage of falling rates."
                },
                {
                    "text": "SoFi doesn’t charge any fees. This includes late fees and overdraft fees. While it benefits you to make your payments on time for more reasons than late fees, it’s nice to know that SoFi has your back should you get caught up in hard times and have to make your payment a little late."
                },
                {
                    "text": "You may be able to change your loan’s due date if it is necessary. SoFi allows you to change it on fixed rate loans once per year."
                },
                {
                    "text": "SoFi offers programs if you become unemployed and can’t make your payments. As long as you stay in contact with SoFi, they may offer options such as forbearance, which lets you off the hook for three months at a time. While the loan still accumulates interest, it gives you time to get caught up without negative consequences."
                }
            ],
            "cons": [
                {
                    "text": "You need good credit. We’ve said this before, but it’s worth mentioning again. While SoFi doesn’t put all of the emphasis on your credit score, they typically look for at least a 680. If your score is significantly below this score, you may have a hard time qualifying."
                },
                {
                    "text": "It takes a while to get your funds. Most online lenders fund their personal loans within 24 – 48 hours, but SoFi takes an average of at least a few days to get the money to its borrowers once approved."
                },
                {
                    "text": "You need to make at least $45,000 per year to qualify, but SoFi typically requires a much higher income with the average borrower making $100,000 per year."
                }
            ]
        },
        "applying": "<p>Applying for a SoFi loan is simple – everything is done online. You’ll complete their online application which you can do in a matter of minutes. Before you start, though, have the following information ready:</p><p><br/></p><p><table class=table\" style=\"width: 100%;\"><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;  border-top-color: rgb(222, 226, 230);\"><ul style=\"box-sizing: border-box; list-style: disc;\" class=\" list-paddingleft-2\"><li><p>How much money you want to borrow</p></li><li><p>Your personal identifying information including your social security number</p></li><li><p>Proof of your identity with your driver’s license and social security card</p></li><li><p>Proof of your address (utility bills, voter registration, credit card bill)</p></li><li><p>Proof of your income (paystubs and W-2s)</p></li><li><p>Proof of your assets (bank statements)</p></li><li><p>Proof of self-employment income (tax returns)</p></li></ul></td></tr></tbody></table><br/></p><p>Each person’s requirements will vary based on your qualifications. Once you complete the application, you’ll know within a matter of minutes if you’re conditionally approved and what information you must provide SoFi to complete the process.</p>",
        "have_bad_credit": "<p>Unfortunately, SoFi isn’t for low credit borrowers. Unless you have serious compensating factors, such as a large cash flow or a lot of assets, you may be better off looking for a loan elsewhere. If you think you have a chance of qualifying, you can enter your information to get a quote. SoFi doesn’t do a hard credit pull to provide a quote, so it doesn’t affect your credit until you officially accept the offer. This gives you a chance to see if you qualify or if you should look elsewhere.</p>",
        "main_loan_features": "<p>SoFi offers attractive loans with the following features:</p><p><br/></p><p><table class=\"table\" style=\"width: 100%;\"><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;  border-top-color: rgb(222, 226, 230);\"><ul style=\"box-sizing: border-box; list-style: disc;\" class=\" list-paddingleft-2\"><li><p>Fixed rates from 5.99 – 19.96% with autopay</p></li><li><p>No upfront fees</p></li><li><p>No late or overdraft fees</p></li><li><p>Loan amounts up to $100,000</p></li><li><p>No prepayment penalties</p></li><li><p>Terms up to 7 years</p></li></ul></td></tr></tbody></table><br/></p><p>Most SoFi customers borrow money to pay off high interest credit card debt, taking advantage of SoFi’s attractive interest rates, but they offer loans for a variety of other reasons as well.</p>",
        "rates_fees": "<p>SoFi prides themselves on the lack of fees. They are very transparent about what they do and don’t charge right on their website even before you apply for the loan. When we say that SoFi loans are ‘free’, it’s the truth. They don’t charge an origination fee, prepayment penalty, late fee, or overdraft fee. The entire amount you borrow is what you receive.</p><p><br/></p><p>The terms you get depend on your situation. The best qualifying borrowers that also opt-in to autopay receive rates as low as 5.99%. Their highest rate is 20.91 (with autopay) and is for borrowers with factors that make them a riskier borrower, such as a lower credit score, lower cash flow, or newer job with less stability.</p>",
        "loan_process": "<p>The SoFi loan process is very simple and direct. We’ve discussed how transparent they are with their fees and they are just as transparent with their loan process.</p><p><br/></p><table class=\"table\" style=\"width: 100%;\"><tbody style=\"box-sizing: border-box;\"><tr style=\"box-sizing: border-box;\" class=\"firstRow\"><td style=\"box-sizing: border-box;  border-top-color: rgb(222, 226, 230);\"><ul style=\"box-sizing: border-box; list-style: disc;\" class=\" list-paddingleft-2\"><li><p>You apply for the loan online, answering the screener questions to receive your quotes.</p></li><li><p>You choose the offer that matches your needs and that has a loan amount that you can comfortably afford.</p></li><li><p>Once you select the offer, SoFi will ask for specific documents that verify the information you provided on the application.</p></li><li><p>The faster you provide the information, the faster SoFi can underwrite your loan and make a final determination.</p></li><li><p>After final approval, SoFi deposits the funds from your loan directly into your checking or savings account that you provide.</p></li></ul></td></tr></tbody></table>",
        "customer_support": "<p>SoFi is very forthcoming with its customer support. Many online lenders only allow you to contact them online, but that’s not the case with SoFi.<br/></p><p><br/></p><p>Anyone can contact them at 1-855-456-7634 with questions or concerns before you are a customer. Their customer support line is available Mondays – Thursday 4 AM to 9 PM PT and Friday – Sunday 4 AM to 5 PM PT.</p><p><br/></p><p>You can also email them at&nbsp;<a href=\"mailto:customerservice@sofi.com\">customerservice@sofi.com</a>&nbsp;or contact them on their Twitter handle at @SoFiSupport.</p><p><br/></p>",
        "bottom_line": "<p>If you are among the ‘elite credit borrowers’, you may have a good chance at securing a personal loan at a rate much lower than any credit card can offer. Even if you don’t have great credit, but show promise in other areas of your life, though, you may still be a good candidate. SoFi is all about giving borrowers chances. They make this apparent not only in their flexible guidelines and low rates, but also in what they offer its community. When you take out a SoFi loan you get more than money in your account – you get resources that help you grow both personally and professionally.</p><p><br/></p><p>If you think you’re a good candidate for a SoFi loan, apply for the loan right on their website. It takes just a matter of minutes to find out how much they may offer you and at what rate. The rest of the process is simple, getting you the funds that you need in a matter of a few days.</p>"
    }
}