{
    "data": {
        "key": "upstart",
        "name": "Upstart",
        "author": {
            "name": "Jessica Cotzin",
            "headImg": "/data/blogs/img/jessica.jpg",
            "desc": "Jessica Cotzin is our resident small business and personal loans whiz. She is a skilled writer with a bachelor’s in journalism from Florida Atlantic University, providing information to her readers on the loans industry and personal finance."
        },
        "date": "May.02,2021",
        "preface": "<p>Upstart is an online lender that works with borrowers with fair or even bad credit. They use a variety of different qualifying requirements and technology to help borrowers that might be turned down by other lenders secure a loan. </p><p><br/></p><p>Upstart credits its unique qualifying abilities to its use of Artificial Intelligence which opens up more opportunities for borrowers with less than perfect credit.</p><p><br/></p><p>But is it worth it? Here’s our Upstart review to help you decide.</p>",
        "overview": "<p>Upstart is a personal loan lender that looks at more than your credit score. While they look at your credit to make sure you are somewhat responsible, they are one of the only lenders to consider other factors too that could make up for your lower credit scores.</p><p><br/></p><p>Upstart focuses on the potential in your career, whether you just graduated college or you’re climbing the corporate ladder. They’ve been known to offer loans to borrowers with mediocre credit, but great career possibilities.</p><p><br/></p><p>If you’re looking for a lender who doesn’t look at the standard credit score and debt-to-income ratio, you’ve found it in Upstart. Your credit score matters, but it’s not the only factor they’ll consider.</p>",
        "loan_account": "",
        "apr": "",
        "minimum_credit_score": "",
        "requirements": "<p>Upstart works differently when qualifying borrowers for the loan. While they have a rule of a minimum 580 credit score, they look at other factors too. For example, if you just graduated college and have barely any credit, but you have many job offers available and will work in a high-demand industry, Upstart may consider that and give you the loan.&nbsp;</p><p><br/></p><p>It’s always helpful to make sure your credit score is as high as it can be before applying though. Before you apply, pull your <a href=\"http://www.annualcreditreport.com/\">free credit report</a> and fix any of the following:</p><p><br/></p><ul style=\"list-style: disc;\"><li><p>Bring late payments current – If you missed a payment or two, bring them current immediately. Give it a few months after bringing the accounts current for your credit score to increase again.</p></li><li><p>Pay your credit card debt down – Your credit card debt shouldn’t be more than 30% of your credit lines. If you overextended your credit, try paying the balances down or use the Upstart loan to pay your credit cards off.</p></li><li><p>Take care of collection accounts – If you have collections, work with the creditors to satisfy them. In your negotiations, ask for the creditor to delete the collection after you satisfy it based on your negotiations.</p></li></ul><p><br/></p><p>Upstart also looks at your current (and future) income compared to your debts. They are unique because they’ll consider your future possibilities, especially if you’re a recent college graduate. While they prefer stable income like most lenders, they’ll look at the big picture to see what you’re capable of doing.&nbsp;</p><p><br/></p><p>Like most lenders, Upstart looks at your current debts. If they are too high, they may suggest you use the funds to pay off your credit card debt. This will bring your debt-to-income ratio down and help you improve your credit score. If you don’t have a lot of outstanding debt, though, it can work in your favor and you may qualify for an Upstart loan.</p><p><br/></p><p>Ideally, you want a stable income and employment history, decent credit, and as many qualifying factors as possible. If there is anything unique about your situation, especially your income, talk to your Upstart representative about it. They may have a program for you just because you have potential in your career.&nbsp;</p>",
        "loan_terms": "",
        "pros_cons": {
            "top": "All lenders have pros and cons. Upstart shines in many areas, but they have weaknesses too. Understanding the good and bad can help you make the right decision for your situation.",
            "bottom": "",
            "pros": [
                {
                    "text": "Upstart typically funds loans as soon as the next business day which is great for borrowers who need the money fast"
                },
                {
                    "text": "If you’re consolidating debt (paying off credit cards with the Upstart loan), Upstart will pay the creditors directly. This reduces the risk of you spending the money before it gets to your credit card, the intended target."
                },
                {
                    "text": "Upstart uses a more flexible underwriting protocol that uses credit scores but looks at other factors too. They give more people a chance at securing a personal loan."
                },
                {
                    "text": "You can change your payment date as often as needed/wanted."
                },
                {
                    "text": "You can pay over the phone, via mail, or online, whatever is easiest for you."
                }
            ],
            "cons": [
                {
                    "text": "You can only choose from a 3 or 5-year payment term, but most other lenders have more options."
                },
                {
                    "text": "Most borrowers pay an origination fee, especially if you have a low credit score."
                },
                {
                    "text": "Upstart only offers loans to single borrowers – no co-borrowers or co-signers"
                },
                {
                    "text": "Upstart charges hefty origination fees which means less money in your pocket."
                }
            ]
        },
        "applying": "",
        "have_bad_credit": "",
        "main_loan_features": "<p>All Upstart loans are unsecured loans. This means you don’t need to use collateral to secure the loan. Because they are unsecured, the interest rates are higher than what you’d find on a home equity loan or secured loan, but lower than most credit cards.</p><p><br></p><p>Upstart loans usually have a fixed interest rate, which means you don’t have to worry about changing rates and payments. You’ll receive the loan’s proceeds in one lump sum as a direct deposit in your bank account, usually the next business day.</p><p><br></p><p>Here’s how the Upstart loan features stack up.</p>",
        "rates_fees": "<p>Upstart starts its fees lower than most personal loan lenders, especially considering the fact that they accept such low credit scores, and sometimes you don’t even need credit to qualify. But, like most lenders, Upstart almost always charges an origination fee. You don’t have to pay for the fee out of pocket, but they take the funds from the proceeds of your loan.&nbsp;</p><p><br/></p><p>Upstart charges origination fees up to 8% depending on your qualifying factors. That’s a large fee, so always make sure you know what you’re paying to get the loan. To reduce your APR and fees, consider the following:</p><p><br/></p><ul style=\"list-style:disc;\"><li><p>Qualifying factors – Upstart looks at all qualifying factors. Even though they include factors other lenders don’t, they look at your typical credit score, income, and current debts. They’ll use your employment history, college degree, and career potential as compensating factors to qualify you for the loan. This doesn’t mean if you have shaky employment or low credit scores that you won&#39;t qualify, but you’ll pay more for them.&nbsp;</p></li></ul><p><br/></p><ul style=\"list-style:disc;\"><li><p>Loan amount – Upstart offers loans up to $50,000, but you’ll pay higher interest rates to get a loan of that size. Depending on your credit and qualifying factors though, you may also pay much higher origination fees, so always know what it costs to get the loan. If you pay 8% on a $50,000 loan, that’s a $4,000 fee.&nbsp;</p></li></ul><p><br/></p><ul style=\"list-style:disc;\"><li><p>Reason for the loan – You can take out an Upstart loan for any reason, but Upstart may grant you a lower APR or fees if the reason is ‘good.’ If you’re investing in your home, for example, you may get a lower APR than someone using the money to pay off credit card debt. There’s a higher risk in debt consolidation than there is in lending money to someone who will reinvest it in an asset like real estate.&nbsp;</p></li></ul>",
        "loan_process": "<p>The Upstart loan process is simple. You can check your rate without hurting your credit or committing to a loan. This is a great feature because it gives you a chance to learn what you’re able to secure.</p><p><br/></p><p>On the application, you’ll disclose your income, estimated credit score, education, and work experience. You’ll also provide your name, address, Social Security number, and approval to check your credit.</p><p><br/></p><p>Initially, Upstart does a soft credit check which doesn’t hurt your credit score. You’ll receive offers based on different loan amounts with various APRs and fees. You can choose the loan that works the best for you and move forward.</p><p><br/></p><p>If you decide to take a loan, Upstart will do a hard credit check and may ask for proof of certain things, such as your income or employment history. Most Upstart loans are closed and funded within 24 hours.</p>",
        "customer_support": "<p>Upstart offers incredible customer service over the phone. They are available Monday – Friday 6 AM – 5 PM PT and Saturday/Sunday 6 AM to 5 PM. You can also make payments over the phone if you’d rather not make the payments online</p>",
        "bottom_line": "<p>If you’re looking for a personal loan lender with flexible guidelines, fast funding, and high loan amounts, you’ve found it in Upstart.</p><p><br/></p><p>Even if you don’t have great credit, you may qualify with a credit score as low as 580 if you have other compensating factors. Upstart uses a unique Artificial Intelligence model to determine your eligibility for a loan.</p><p><br/></p><p>Watch out for the origination fees and do your best to maximize your credit score so you get the lowest interest rate they offer. Upstart is a great way for borrowers who don’t qualify elsewhere to get a personal loan.</p><p><br/></p><p>It doesn’t cost anything to get a quote and see your rate, give Upstart a try and see what they may offer you.</p>"
    }
}