{
    "key": "p7",
    "category": "personal_loans",
    "date": "Apri.18,2021",
    "author": {
        "headImg": "/data/blogs/img/jessica.jpg",
        "name": "Jessica Cotzin",
        "jobTitle": "Financial Profesional"
    },
    "title": "6 Proposals Then President-Elect Joe Biden Put Forth In His Emergency Rescue Plan",
    "content": "<p>U.S. President Joe Biden put together the Emergency Rescue Plan (now known as the American Rescue Plan of 2021) that would save the economy. It’s a plan, he said, he would enact immediately after getting into office.&nbsp; And, to show proof that Biden was going to do that, the now-president put together a COVID-19 advisory board and various relief proposals while he was president-elect.&nbsp;</p><p><br/></p><p>Much of his plan’s inspiration came from the CARES act, passed in March 2020 by former president Donald Trump. The plan included more stimulus checks (but larger), extra unemployment benefits, small business support, etc. What are some of the things included in the package?</p><p><br/></p><h3 style=\"font-size: 22px\">Stimulus Checks</h3><p><br/></p><p>The package included additional stimulus checks. At the time of Biden’s elect, the proposal made no clear mention of how much extra money people would receive and who would be eligible but was thought to resemble the CARES act.&nbsp; The idea was to give extra checks to families if conditions warranted it.</p><p><br/></p><p>A deadlock in Congress held up the relief many Americans sought, so another check coming was a relief to many Americans.&nbsp;</p><p><br/></p><p>In the end, qualifying Americans would receive the maximum of $1,400 per person (children included).&nbsp;</p><p><br/></p><h3 style=\"font-size: 22px\">Additional Unemployment Benefits</h3><p><br/></p><p>Much like the CARES act, Biden would ask for more unemployment benefits to help Americans who are still out of work. Initially, Biden wanted the extra $600 to continue until the pandemic was over. When the package passed Congress (without Republican support), the extra unemployment benefit amount was $300.&nbsp;</p><p><br/></p><h3 style=\"font-size: 22px\">Additional Monies For Testing and Treatment</h3><p><br/></p><p>When the plan was announced, Biden wanted to make sure that no one had to pay for being tested or treated for coronavirus. He wanted to make sure that people would not be stuck with unexpected hospital bills.&nbsp;</p><p><br/></p><p>The Trump administration did set up a program that would cover the costs of uninsured infected and hospitalized with COVID-19. However, the New York Times learned many people were getting bills – small and large.&nbsp;</p><p><br/></p><p>Biden’s plan would make sure Americans would not have to deal with the testing expenses or getting their employer to pay for it.&nbsp;</p><p><br/></p><h3 style=\"font-size: 22px\">Paid Leave For COVID Sufferers</h3><p><br/></p><p>Rather than letting employers choose whether or not to support employees who get COVID-19, Biden suggested an emergency sick leave option for everybody, including full-timers, part-timers, freelancers, contractors or self-employed.&nbsp;</p><p><br/></p><p>Biden said the pandemic unveiled the lack of protections in the workplace, especially for people of color who were often the essential workers that worked in hazardous conditions during the health crisis.&nbsp; He said tougher labor protections would help those individuals.&nbsp;</p><p><br/></p><h3 style=\"font-size: 22px\">Social Security Check Increase</h3><p><br/></p><p>With or without the pandemic, the reality is that social security benefits do little to help seniors pay for living and medical expenses. Biden suggested a $200 increase in social security checks to seniors – something not offered in the first and subsequent stimulus packages. The increase would certainly help those at risk (seniors and people with disabilities).&nbsp;</p><p><br/></p><h3 style=\"font-size: 22px\">Fiscal Relief For States&nbsp;</h3><p><br/></p><p>Much of the COVID-19 financial relief fell on the states.&nbsp; For instance, California spent $260 million to cover public health expenses. Wisconsin spent $400 million on community and hospital preparedness. However, money has dried up, leaving little resources to aid communities.&nbsp;</p><p><br/></p><p>Biden proposed giving states fiscal relief to help their communities get the relief needed. Biden also suggested $377 billion in small business money to help them stay in business, covering rent and paying employees.&nbsp;</p><p><br/></p><h3 style=\"font-size: 22px\">Student Loan Forgiveness</h3><p><br/></p><p>When Biden was elected president, he had hoped to provide student loan forgiveness (about $10,000 in federal student loans per borrower). He didn’t just want to extend the forbearance period but wanted to erase debt for millions of borrowers.&nbsp;</p><p><br/></p><p>While the first extension was indeed helpful for the millions of borrowers at the start and height of national lockdowns, true loan forgiveness would be more beneficial to borrowers with a collective debt of $1.6 trillion.&nbsp;</p><p><br/></p><p>To date, there has been no $10,000 student loan forgiveness provided.&nbsp;</p><p><br/></p><p><br/></p><p><br/></p>"
}