{
    "key": "p3",
    "category": "personal_loans",
    "date": "Apri.18,2021",
    "author": {
        "headImg": "/data/blogs/img/jessica.webp",
        "name": "Jessica Cotzin",
        "jobTitle": "Financial Profesional"
    },
    "title": "3 Common Personal Loans When You Can’t Qualify",
    "content": "<p style=\"white-space:normal;\"><span style=\"white-space:normal;\">Whether you’re looking for more money for a costly home project or just need some cash to tide you over until your next payday, you have a number of options for getting a personal loan.<br></span><span style=\"white-space:normal;\">You can choose non-traditional options or look to lenders like banks and credit unions. Personal loans can be a fitting solution for a number of reasons. They can be used at your discretion for whatever you choose, allow you quick access to cash, have lower interest rates than credit cards, provide fixed rates and terms, and offer a range of lenders.<br></span><span style=\"white-space:normal;\">Personal loans are available as secured loans or unsecured loans. With a secured loan, the money you’re borrowing is backed by collateral, so it’s easier to qualify for this type of loan. Home loans and auto loans are examples of secured loans. With an unsecured loan — also referred to as a signature loan — you don’t need to put up any collateral. Student loans and credit cards are examples of unsecured loans.<br></span><img style=\"width: 100%;\" src=\"/data/blogs/img/p-3.webp\" alt=\"\" width=\"697\" height=\"392\" title=\"\" align=\"\"><br> Personal loans vary. Although most are fixed-rate loans, not all are low-interest loans and some are only available to consumers with good credit. Here are seven unsecured personal loan types for you to consider; check out advantages, disadvantages and <strong>typical terms and rates</strong> so you can better decide which is the best personal loan for your financial strategy.<br><span style=\"white-space:normal;\"><strong>Peer-to-peer lending</strong> — also called person-to-person, P2P or social lending — connects borrowers with investors willing to fund their loans. Because P2P lenders operate exclusively online, there are savings opportunities for consumers in the form of lower interest rates. For P2P loans, approval depends on a number of factors, which can include debt-to-income ratio, financial history and even career experience. Application requirements include proof of income and employment.<br></span><span style=\"white-space:normal;\">Here’s a quick look at P2P lending advantages and disadvantages:<br></span><strong style=\"white-space:normal;\">Pros:</strong> </p><ul style=\"white-space:normal;\"><li> Interest rates are low and fixed.</li></ul><ul style=\"white-space:normal;\"><li> No prepayment penalties are charged.</li></ul><ul style=\"white-space:normal;\"><li> Loans as large as $100,000 are available.</li></ul><strong style=\"white-space:normal;\">Cons:</strong> <ul style=\"white-space:normal;\"><li> P2P loans are generally limited to borrowers who have are in the credit score range of good or above-average credit.</li></ul><ul style=\"white-space:normal;\"><li> These loans are generally for high-income borrowers.</li></ul><ul style=\"white-space:normal;\"><li> Borrowers pay an origination fee of between 1 percent and 5 percent of the loan amount.</li></ul><ul style=\"white-space:normal;\"><li> This option is not available in all states.</li></ul><ul style=\"white-space:normal;\"><li> Online payments are not available; additional payments can only be made by mail.</li></ul><span style=\"white-space:normal;\">The largest P2P lender is <strong>Lending Club</strong>. Through Lending Club, a person can borrow up to $40,000 with a fixed interest rate for just about any purpose. The monthly principal and payment are also fixed. The minimum to borrow is $1,000, and loan terms are three or five years. <strong>Interest rates start at 5.99% APR</strong>.<br></span><span style=\"white-space:normal;\">As of December 2019, the average Lending Club borrower had the following:</span> <ul style=\"white-space:normal;\"><li> 699 FICO score</li></ul><ul style=\"white-space:normal;\"><li> 18.12 percent debt-to-income ratio, excluding mortgage</li></ul><ul style=\"white-space:normal;\"><li> 16.3 years of credit history</li></ul><ul style=\"white-space:normal;\"><li> $75,055 personal income</li></ul><ul style=\"white-space:normal;\"><li> $14,741 average loan size</li></ul><strong style=\"white-space:normal;\">Lending Club</strong><span style=\"white-space:normal;\">&nbsp;reviews indicate that there are other online lenders with loan terms that are more flexible and that Lending Club generally appeals to high-income earners with above-average credit. Payments are automatically deducted from your bank account, which could be considered a positive or negative feature.<br></span><strong style=\"white-space:normal;\">Prosper&nbsp;</strong><span style=\"white-space:normal;\">is another P2P lending company that offers personal loans at low rates for those with good credit. Prosper loans are unsecured, so you don’t have to put up any collateral in the event that you can’t make a payment. All loans have either a 36- or 60-month term, and rates start at 5.99% APR. Your credit, income and the number of investors bidding on your loan will determine your interest rate. Prosper offers loans between $2,000 and $35,000.<br></span><span style=\"white-space:normal;\">According to LendingMemo, a provider of information on P2P lending, Prosper loan reviews have included criticisms of the high credit scores and income levels required for approval. Applicants could be disqualified for having poor credit scores. Also, loans are not available in Iowa, Maine and North Dakota.<br></span><strong style=\"white-space:normal;\">SoFi</strong><span style=\"white-space:normal;\">, another online lender, offers loans between $5,000 and $100,000. SoFi loans have no origination fee, prepayment penalty or balance transfer fee. Rates start at 5.95% APR, and lending terms are three, five or seven years. SoFi offers a couple of perks, such as protection against unemployment, which freezes payments while you are unemployed. Second, if you pay electronically via its AutoPay feature, you can earn a 0.25-percent discount on your rate.<br></span> 2. Debt Consolidation Loan<br><span style=\"white-space:normal;\">Another type of personal loan is the debt consolidation loan. With debt consolidation loans, you combine all your debts into one loan payment each month — ideally, at a lower rate. This type of loan is great for people who can stick to a debt payment plan.<br></span><span style=\"white-space:normal;\">Here are some other advantages and disadvantages of this loan type:<br></span><strong style=\"white-space:normal;\">Pros:</strong> <ul style=\"white-space:normal;\"><li> Payments are simplified to only one per month.</li></ul><ul style=\"white-space:normal;\"><li> Interest rates can be lower than those of credit cards.</li></ul><strong style=\"white-space:normal;\">Cons:</strong> <ul style=\"white-space:normal;\"><li> It’s not guaranteed that you’ll reduce or pay off debt sooner.</li></ul><ul style=\"white-space:normal;\"><li> Debt-transfer fees might apply.</li></ul><ul style=\"white-space:normal;\"><li> Depending on their credit, borrowers might not qualify for lender’s advertised rate.</li></ul><span style=\"white-space:normal;\">In addition to consolidating credit card debt, another common reason for obtaining a consolidation loan is to consolidate student loan debt. Here’s what an option for student loan consolidation looks like from Wells Fargo:</span> <ul style=\"white-space:normal;\"><li><strong>Fees:</strong>&nbsp;none</li></ul><ul style=\"white-space:normal;\"><li><strong>Variable interest rates:</strong>&nbsp;from 3.49% APR (with discounts) to 8.74% (without discounts)</li></ul><ul style=\"white-space:normal;\"><li><strong>Fixed interest rates:&nbsp;</strong>from 5.99% APR (with discounts) to 10.99% APR (without discounts)</li></ul><ul style=\"white-space:normal;\"><li><strong>Discounts:</strong>&nbsp;0.25-percent interest rate reduction for existing customers; 0.25-percent discount when borrowers use AutoPay for monthly repayments</li></ul><ul style=\"white-space:normal;\"><li><strong>Loan amount:</strong>&nbsp;up to $120,000</li></ul><ul style=\"white-space:normal;\"><li><strong>Rate of terms:</strong>&nbsp;15-year term for amounts under $50,000; 20-year term for anything over $50,000, according to a customer service representative</li></ul><span style=\"white-space:normal;\">Under the general terms of an installment loan, you agree to pay the loan back to the lender in monthly payments over a set period of time. Unlike payday loans, installment loans have a longer duration and lower interest rates. Personal installment loans commonly range from $150 to a few thousand dollars, but some providers offer loans of up to $35,000. Interest and other fees are commonly paid in fixed monthly payments. Here are some other advantages and disadvantages to installment loans.<br></span><strong style=\"white-space:normal;\">Pros:</strong> <ul style=\"white-space:normal;\"><li> They’re easy to obtain.</li></ul><ul style=\"white-space:normal;\"><li> They’re available to low-income customers.</li></ul><ul style=\"white-space:normal;\"><li> A variety of money-lending institutions offer them.</li></ul><strong style=\"white-space:normal;\">Cons:</strong> <ul style=\"white-space:normal;\"><li> Interest rates are high.</li></ul><ul style=\"white-space:normal;\"><li> Fees are large.</li></ul><span style=\"white-space:normal;\">Requirements, range of terms, APR and the amount of loan that a customer might qualify for all depend on credit and where the customer resides, according to installment loan provider Avant. Terms for Avant installment loans range from 24 to 60 months.<br></span><span style=\"white-space:normal;\">Here’s what you can expect from a typical Avant installment loan:</span> <ul style=\"white-space:normal;\"><li> Loan amount: $1,000</li></ul><ul style=\"white-space:normal;\"><li> Interest rate: 25% APR</li></ul><ul style=\"white-space:normal;\"><li> Number of payments: 24</li></ul><ul style=\"white-space:normal;\"><li> Monthly payment: $53.37</li></ul><span style=\"white-space:normal;\">With installment loans, online payment is not available; instead, monthly payments are automatically withdrawn from the borrower’s bank account.<br></span>1. Peer-to-Peer Loans<br> &nbsp;3. Installment Loans<p><br></p>"
}