{
    "key": "p4",
    "category": "personal_loans",
    "date": "Apri.25,2021",
    "author": {
        "headImg": "/data/blogs/img/jessica.jpg",
        "name": "Jessica Cotzin",
        "jobTitle": "Financial Profesional"
    },
    "title": "Personal Loan Origination Fees: What You Should Know?",
    "content": "<p><strong>What Is a Loan Origination Fee?</strong> </p><p><strong><br></strong> </p><p>An origination fee is a fee you pay to your lender when you receive funds. The charge compensates your lender for expenses like processing your application and marketing. Fees typically range from 1% to 8% of the amount you borrow, although you might pay a flat fee or nothing at all, depending on the lender.</p><p><br><strong>How Personal Loan Origination Fees Work</strong> </p><p><strong><br></strong> </p><ul><li><strong>When do you pay?</strong> You typically only pay an origination fee if your loan is approved and funded. You might have to pay other<strong> “loan application”</strong> or <strong>“credit check” </strong>fees regardless of the outcome, but you should not pay an origination fee if your application is denied.</li></ul><ul><li><strong>How do you pay?</strong> <span>In many cases, you don’t actively “pay” an <strong>origination fee</strong>. Instead, the funds come out of your loan proceeds, and you receive less than your full loan amount (as in the example above).2﻿ When that’s the case, it’s crucial to apply for a loan that covers your origination fee as well as your borrowing need. In other words, borrow a little extra.</span> </li></ul><ul><li><strong>What are you paying for? </strong>Origination fees are compensation for your lender. Yes, the lender also charges interest, but it gets interest income over time, while origination fees are instant. If you pay off your loan too quickly, the loan might not be profitable for lenders, who might stop lending or need to use other fees to earn revenue. Your origination fee covers upfront costs like:</li></ul><ul><li>Checking your credit with credit bureaus or alternative sources</li><li>Verifying your income with national databases</li><li>Reviewing your application to determine whether or not to approve the loan</li></ul><p><strong>Should You Pay an Origination Fee?</strong> </p><p><strong><br></strong> </p>Don’t assume that loans without origination fees are best. Evaluate offers from multiple lenders, and choose the best option with the big picture in mind.<ul><li><strong>What’s your strategy?</strong> As a rule of thumb, the faster you plan to pay off a loan, the less it makes sense to pay an origination fee. If you consolidate high-interest-rate debts with a personal loan and you intend to pay off the balance within the next 12 months, paying an upfront fee may be expensive because you don’t benefit from a low rate for very long.</li></ul><ul><li><strong>Interest rate: </strong><span>A loan’s interest rate is critical. If you can secure a<strong> low-interest rate by paying an origination fee</strong>, you might pay less overall. But you need to run some numbers to understand exactly how your costs work. You can calculate costs with online calculators and spreadsheets to get specific numbers for any loan you’re evaluating.</span> </li></ul><ul><li><strong>Loan features:</strong> Investigate details about every loan you’re considering, and determine how that loan fits with your needs. For example, if you plan to pay off debt aggressively, a loan with a prepayment penalty might not be ideal. But you can compare that penalty to the origination fee on a competing loan and choose the least costly option.</li></ul><ul><li><strong>Compare the APR:</strong> A loan’s <strong>annual percentage rate (APR)</strong> can help you choose the lowest-cost loan. APR attempts to describe the total cost, including both the interest rate and any required fees like origination fees. The <strong>APR calculation</strong> isn’t always perfect, but it’s a quick and easy way to get an apples-to-apples comparison.</li><li><strong>Run the numbers: </strong><span>To calculate the effect of an origination fee (and see a worksheet with the example below), check your numbers with an origination fee calculator in Google Sheets.</span> </li></ul><p>Lenders are usually not willing to negotiate about origination fees. You can ask, but if you're unhappy about the fee, your best bet is to find a different lender.</p><p><br></p><p><img src=\"/data/blogs/img/p-4.jpg\" alt=\"\" style=\"white-space:normal;width: 100%;\"> </p><p><br></p><p><strong>Breaking Even</strong> </p><p><br></p>If you’re deciding between two loans—one of which has an origination fee—how do you know which is best? One approach is to use a breakeven analysis. The quickest form of breakeven tells you how long it takes to recoup the cash you spend on origination fees (if those fees result in a lower monthly payment). If you plan to keep the loan long enough to recover the origination fee, the upfront charge may be worth it.<br> For example, assume you want to borrow $8,000 with a seven-year loan, and you have two offers.<ul><li><strong>Loan A</strong> has an interest rate of 10%, which results in a monthly payment of $132.81.</li></ul><ul><li><strong>Loan B</strong> includes a 2% origination fee of $160 (assume you pay out-of-pocket for simplicity) and an interest rate of 8%, so your monthly payment is $124.69.</li></ul>Which is a better deal? All other things being equal, it could depend on how long you take to repay the loan. To calculate the breakeven time:<br><ol><li>The difference between monthly payments is $8.12 ($132.81 minus $124.69).</li><li>Divide that difference into the origination fee ($160 divided by $8.12) for a breakeven period of 19.7 months.</li></ol>If you intend to keep this personal loan for at least 20 months (a year and eight months), you should come out ahead with Loan B, even though you pay an origination fee. After 19 months, the total amount you pay, including interest charges and the origination fee, should be less than you pay on Loan A—plus you get a lower monthly payment.<p>For example, assume you borrow $8,000 with a personal loan. If the loan has a 2% origination fee, you pay $160. In many cases, the fee comes out of your loan proceeds, so the lender gives you $7,840 (your $8,000 loan minus the $160 origination fee).</p> "                               
                                
}