{
    "key": "p5",
    "category": "personal_loans",
    "date": "Apri.24,2021",
    "author": {
        "headImg": "/data/blogs/img/adam.webp",
        "name": "Adam West",
        "jobTitle": "Financial Experts"
    },
    "title": "How Long Does It Take to Get a Personal Loan?",
    "content": "<p><span style=\"font-size: 16px;\">While every lender may have its own process, below is an overview of what you may be able to expect when</span><strong><span style=\"font-size: 16px;\"> considering a personal loan </span></strong><span style=\"font-size: 16px;\">from both an online lender or a traditional bank or credit union. However, the time it takes for you to secure a personal loan may depend on your specific financial situation.</span> </p><p><br></p><p></p><table border=\"2\" cellpadding=\"1\" cellspacing=\"1\" style=\"text-align:center;\" class=\"ke-zeroborder\" bordercolor=\"#666666\"><tbody><tr><td height=\"24\" width=\"250\" style=\"text-align:center;\"></td><td class=\"xl65\" width=\"281\" style=\"text-align:center;\"><p><span style=\"font-size: 16px;\">Online  Lenders</span> </p></td><td class=\"xl65\" width=\"289\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Traditional  Banks or Credit Unions</span> </p></td></tr><tr><td height=\"23\" class=\"xl65\" width=\"250\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Overall Speed</span> </p></td><td class=\"xl66\" width=\"281\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Three to  seven days</span> </p></td><td class=\"xl66\" width=\"289\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Same day  to several days</span> </p></td></tr><tr><td height=\"23\" class=\"xl65\" width=\"250\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Application Time</span> </p></td><td class=\"xl66\" width=\"281\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Plan for  15 minutes or so</span> </p></td><td class=\"xl66\" width=\"289\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Plan for  15 to 60 minutes</span> </p></td></tr><tr><td height=\"23\" class=\"xl65\" width=\"250\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Approval Time</span> </p></td><td class=\"xl66\" width=\"281\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Three to  seven days</span> </p></td><td class=\"xl66\" width=\"289\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Same day  to several days</span> </p></td></tr><tr><td height=\"23\" class=\"xl65\" width=\"250\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Funding After Approval</span> </p></td><td class=\"xl66\" width=\"281\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">One to  seven business days</span> </p></td><td class=\"xl66\" width=\"289\" style=\"text-align:center;font-size: 16px;\"><p><span style=\"font-size: 16px;\">Same day  to several days</span> </p></td></tr></tbody></table><p></p><p><img src=\"/data/blogs/img/p-5.webp\" alt=\"\" style=\"width: 100%;margin: 20px 0;\"> </p><ul><li><span style=\"font-size: 16px;\"><strong>Online Lenders</strong></span> </li></ul><span style=\"font-size: 16px;\">Online lenders typically have a fast and easy application process, but receiving money in your bank account may still take several days. If you have limited time to shop around and fill out applications—but can wait a few days for the cash to arrive in your account—an online lender may be an excellent choice.<br><br></span> <p><span style=\"font-size: 16px;\"> The time it takes to receive money ultimately depends on several factors: how long it takes to complete an application, how long the lender needs to review your request, and how quickly money moves to your bank account after approval.</span> </p><p><span style=\"font-size: 16px;\"><br></span> </p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Application Time</strong></span> </li></ul><p><span style=\"font-size: 16px;\">With many online lenders, applying for a loan takes just a few minutes. You provide basic information such as your Social Security number and information about your income, and you receive a preliminary rate quote.1﻿ If you decide to move forward, lenders verify your information and evaluate your application.</span> </p><p><span style=\"font-size: 16px;\"><br></span> </p><span style=\"font-size: 16px;\"> <ul><li><span style=\"font-size: 16px;\"><strong>Approval Time</strong></span> </li></ul>It typically takes online lenders several days to approve a loan request. For example, Upstart estimates three to four days of review time. Prosper expects to do it in about five business days.2﻿<br><br></span> <p><span style=\"font-size: 16px;\"> Lenders review your credit history and other details when deciding whether or not to grant you a loan, and that process takes time.&nbsp;</span> </p><p><span style=\"font-size: 16px;\"><br></span> </p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Funding After Approval</strong></span> </li></ul>Once you’re approved, lenders transfer your loan proceeds, often to your bank account. Again, that process can take several days, depending on bank holidays, how quickly your bank clears the deposit in your account, and other factors. Upstart can potentially fund your bank account on the business day after you accept your loan offer.3﻿ LendingClub simply says that transfers may take a few days. Check with your bank to verify when that money is free to spend.<p><span style=\"font-size: 16px;\"><br></span> </p><ul><li><span style=\"font-size: 16px;\"><strong>Banks and Credit Unions</strong></span> </li></ul>You can also borrow from brick-and-mortar banks and credit unions (or their online counterparts). These institutions can sometimes fund your loan within one day, although the speed varies from bank to bank. If you have access to multiple banks, ask each one how long it takes to get a loan and choose the best one.<br><br><p>With local banks and credit unions, you can visit a branch and apply in person. This may be good if you can quickly get an appointment and gain access to the funds faster. But if it’s days before you can meet with the banker or the application requires information that you don’t have on you at the time, applying online from home will probably be easier.&nbsp;</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Application Time</strong></span> </li></ul><p>Depending on your lender, you might fill out an online form, use an old-fashioned paper application, or fill out the application with a representative from the bank. When you fill something out on paper, there’s no instant data verification, so it’s easy to submit an incomplete application. Also, the form might ask numerous questions that seem irrelevant. Take your time filling out the application no matter what to ensure it’s complete. This may help speed up the process.</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Approval Time</strong></span> </li></ul><p>With some lenders, you may receive funds on the same day you apply. That’s an advantage if you need cash quickly, but keep in mind that some banks take up to several business days to review your application.5﻿ You’ll need to back up information you provide the lender, and the bank will review your credit history. That process takes time, but it can be completed within one business day, assuming staff members have the capacity to complete your request.&nbsp;</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Funding After Approval</strong></span> </li></ul><p>The bank can potentially fund your account on the same day you’re approved. Some may take one business day, while others may take longer.6</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Tips for Fast Approval</strong></span> </li></ul><p>To help things move as quickly as possible, be prepared before you apply, and select your lenders wisely.</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Gather Information</strong></span> </li></ul>Lenders may need to verify your identity and financial details when reviewing your application. The sooner you provide that information, the sooner they can move forward. Find out what documents and details your lender needs so you can submit a complete application. Examples may include:<br><br>A valid driver’s license or passport number<br>Amount of total income from all sources<br>Proof of income, such as a paystub or information about your employer<br>Information about your monthly expenses7﻿<br>Check Your Credit<br><p>Problems in your credit report can lower your scores and cause a rejection, and sometimes, those problems are just mistakes. You can fix credit report errors, but that can take several weeks or months, so give your credit a once-over before you apply for a loan.</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Choose the Right Lender</strong></span> </li></ul><p>Select a lender that can provide funding when you need it. Search, call, or chat online with customer service representatives to find out how long it takes to get a loan. Also, choose a lender that you believe you will qualify with. Some lenders prefer applicants with higher credit scores, while others are willing to work with borrowers with less-than-perfect credit.</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Apply Sooner Than Later</strong></span> </li></ul><p>Remember that lenders must spend time reviewing your application, verifying the details, and funding your loan. Especially if you’re trying for same-day funding, it’s wise to apply early in the day. Online lenders may have several people applying at the same time, which could cause a delay, so get it done as soon as you decide on a lender.</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>Complete Everything</strong></span> </li></ul><p>Make sure your application is thorough and accurate. Mistakes or questions can cause additional delays. If you’re not sure how to answer a question, contact the lender and ask.</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>What to Watch Out For</strong></span> </li></ul>When speed is a priority, you may end up paying more. The fastest loans available may have high rates and fees. While you can solve an immediate problem with products like payday loans, be wary of borrowing money that will be difficult to pay off and cause financial struggles.8﻿<br><br><p>Con artists sometimes target people who are desperate for cash, too. Beware of misleading promises, especially if you’re denied by a traditional lender or it says you need to wait longer than you’d like for the funds. Unfortunately, paying an upfront, out-of-pocket fee is often a sign of a scam.9﻿ Some personal loans have origination fees, but those charges come out of your loan proceeds—after you’re approved.</p><p><br></p><ul><li><span style=\"font-size: 16px;\"><strong>The Bottom Line</strong></span> </li></ul>Whether you’re interested in securing a personal loan to help consolidate debt or tackle a home improvement project, consider all of your options. Consult your bank as well as online lenders and credit unions to determine which loan is right for you. Be prepared with personal information on hand to speed up the process, and be wary of payday loans or scams with high fees. With the right approach, you may have the money you need in just a few days. "
}