{
    "key": "p6",
    "category": "personal_loans",
    "date": "Apri.18,2021",
    "author": {
        "headImg": "/data/blogs/img/jessica.jpg",
        "name": "Jessica Cotzin",
        "jobTitle": "Financial Profesional"
    },
    "title": "4 Questions To Consider Before Submitting A Credit Card Application",
    "content": "<p>Many people are happy with having just one credit card, while others feel comfortable with two or more. If you feel more comfortable with the idea of having multiple credit cards, there are a few things to be mindful of before applying for a new credit card to add to your collection.&nbsp; Ask yourself the following questions to ensure a new credit card is right for you.</p><h3 style=\"margin: 15px 0;font-size: 22px\">When Did I Last Apply For A Credit Card?</h3><p>When you apply for credit cards, your credit report gets pulled, and your credit score gets a ding. If you’re applying for multiple cards at one time, creditors see it and wonder if you’re having financial difficulties.&nbsp; If you’re looking to add a credit card to your collection, and it’s only been a couple of weeks since you last applied, hang tight for a bit.&nbsp;</p><p><br/></p><p>How long? It’s best to wait a minimum of three months before you submit another credit card application. Six months to a year is much better. By waiting, you raise the chances of being approved for the card.&nbsp;</p><h3 style=\"margin: 15px 0;font-size: 22px\">Are There Any Fees? Do The Fees Make The Card Worth Applying?</h3><p>Some credit cards don’t charge money to open an account, but some companies charge annual fees. An annual fee may or may not be worth the card, but if you can get cashback from the card to cover the annual fee and much more, then it may be worth considering.&nbsp;</p><p><br/></p><p>For instance, if the credit card has a $75 annual fee, but it offers a 2% cashback on all purchases, then it may be worth getting if you’ll be using it for most of your purchases. You won’t lose any money on the annual fee, and you’ll make a little extra at the same time.&nbsp;</p><p><br/></p><p>Do not sign up for a credit card that charges an annual fee unless you know you’ll make the money back.&nbsp; First, look at credit cards that don’t charge annual fees to see if any of them are better for you.&nbsp;</p><h3 style=\"margin: 15px 0;font-size: 22px\">Are There Perks That I Can Actually Enjoy?</h3><p>Many credit cards offer perks, such as 2% cashback on restaurants, but if you’re going out a couple of times or so a year, then you’re not getting much of a benefit. A travel credit card also makes no sense if you don’t take a lot of trips.&nbsp; However, if you travel a lot, you may want to consider a travel rewards credit card.&nbsp;</p><p><br/></p><p>The key is finding a credit card that offers a rewards program that you can benefit from.</p><p><br/></p><p>For example, Chase has teamed up with Amazon to offer an Amazon Chase Credit Card. If you are an Amazon Prime member, you can get 5% cashback on all Amazon purchases, 2% on restaurants and gas and 1% on all other purchases (Wal-Mart, Target, etc.). If you use the Chase card, you can rack up a lot of points in a month. Best of all, there is no annual fee.&nbsp;</p><h3 style=\"margin: 15px 0;font-size: 22px\">Will I Have Problems Getting The Sign-Up Bonus?</h3><p>Many credit card companies try to entice customers with a sign-up bonus. The key to getting that sign-up bonus is contingent on charging so much on the card within a period of time.&nbsp;</p><p><br/></p><p>For example, a company may offer you $200 cashback, but only if you spend $1,000 within three months. If you plan on spending that much money in that timeframe, it may be worth signing up for the card. If you have to force yourself to spend that money to claim the bonus, then financially speaking, you’re not getting any further ahead. You could actually lose money!</p><p><br/></p><p>Credit card companies use new gimmicks in the hope of luring consumers to apply. Before you do this, consider the pros and cons of the card itself. This helps reduce the chances of getting the wrong card or applying at the wrong time for the ideal card.&nbsp;</p><p><br/></p>"
}