{
    "data": [
        {
            "title": "How unsecured personal loans work",
            "content": "<p>When you need money to pay off credit cards, have an unexpected expense or want to do a home renovation, you may consider an unsecured loan as your option to pay off the debt or complete the project. An unsecured loan needs no collateral for approval (such as a car or house). Instead, the information these leaders use to extend or deny you credit is:</p><ul><li>Income</li><li>Credit history</li><li>Outstanding debts</li></ul><p>If you default on an unsecured loan, the lender is unable to recoup the losses through your personal belongings. Instead, they can file a lawsuit, and your credit will suffer tremendously. </p><p>An unsecured personal loan can help you in all kinds of ways, but it should only be used to ensure your financial goals are met without additional financial hardship. If you need a personal loan, it’s important to understand its benefits and drawbacks, how they are used, where you can apply for them, and the qualifications for approval. </p>"
        },
        {
            "title": "Unsecured Personal Loans Process",
            "content": "<p>Unsecured loans come in a lump sum – as little as $1,000 to as much as $100,000. The money is paid back in monthly installments with interest. The annual percentage rate on these loans can run from as little as six percent to as much as 36%. The average APR for borrowers with excellent credit (FICO score of 720 to 850) is 11.2%. Borrowers with bad credit (FICO score under 630) have an average of 25.3%.</p><p>Unsecured loan lenders may charge an origination fee to process the loan, with a range of 1% to 10% of the loan amount. Other fees you could expect to pay include:</p><ul><li>Late fees</li><li>Prepayment penalty fees (should you pay off the loan early)</li><li>Insufficient funds fee</li></ul><p>Banks, credit unions and online lenders provide reliable unsecured loans. They will run a credit check to ensure you can afford the loan and pay it back. They will also report your payments (or lack thereof) to the three credit bureaus – Equifax, TransUnion and Experian. Making timely payments will help your credit score; late payments will damage it.</p>"
        },
        {
            "title": "Why Should You Consider An Unsecured Personal Loan",
            "content": "<ul><li>You can get the money much faster from an unsecured loan than from a secured loan, which often needs documentation like proof of a car title). </li><li>Lender cannot repossess property if you cannot or do not make payments.</li><li>People who have excellent credit scores can attain very good rates that are seen with secured loans.</li></ul>"
        },
        {
            "title": "Why Should You Be Hesitant About Personal Loans ",
            "content": "<ul><li>Lenders view unsecured loans are risky, so people with bad credit may be subjected to higher interest rates.</li><li>A default on an unsecured loan will drop your credit score. </li><li>A loan collection agency may be called in to recoup the lender’s loss, meaning you could get unsolicited phone calls and be sued for the debt. </li></ul>"
        },
        {
            "title": "What Are The Kinds Of Unsecured Personal Loans You Can Get",
            "content": "<p>There are all kinds of reasons a person will apply for a personal loan – home improvement, debt consolidation, etc. – which must be repaid within two to seven years after the approval. What are the most common reasons people apply for an unsecured personal loan?</p><p><strong>Financial Health Improvement</strong> </p><p>If you need to get control over finances or make home improvements, lenders can provide debt consolidation loans and home improvement loans to help fund the task. </p><ul><li>With a home improvement loan, you can add value to the home, allowing you to ask more for it if you choose to sell.</li><li>A debt consolidation loan can allow you to pay off existing debt at a lower interest rate. </li></ul><p><strong>Discretionary Expense Loans</strong> </p><p>It’s better to save for discretionary events such as road trips or overseas vacations. If you don’t have enough money for the discretionary expense, a personal loan will provide you with a lower rate than what you’d get with a credit card. Be sure to look at all the options and choose the loan that offers the least expensive scenario for what you want to spend the money on.</p><p><strong>Unexpected Expenses Loans</strong> </p><p>When unexpected expenses arise, such as medical bills, car repairs or other emergencies, you can opt for an unsecured personal loan. However, it may not be the best course of action and should be the last option available. In many cases, there are other ways to fund your unexpected emergencies and bills, such as a local resource or medical payment plan. However, if you need the loan immediately, you can talk with a lender to see which one offers rapid funding, little fees and low rates. </p>"
        },
        {
            "title": "What Are The Eligibility Requirements Of An Unsecured Personal Loan?",
            "content": "<p>When you apply for a personal loan, lenders will investigate whether or not you are financially reliable in paying the “new” debt back. What do they look for before they make you an offer with acceptable rate terms?</p><p><strong>Credit</strong></p><p>Your credit score is the primary factor in their decision of whether or not to extend you credit. If you have a good credit score (or excellent credit score), the chance of being offered an unsecured personal loan with great loan rates is higher. They will look at the age of your credit history as well. Lenders want borrowers who have two or more years of credit history. </p><p><strong>Debt-to-Income Ratio</strong> </p><p>Lenders will also review your debt-to-income ratio. How much your monthly debt is compared to your monthly income. They want to know how much debt you are already struggling with. If you have an excessive amount of debt, they may see you as too risky of a borrower to extend credit to. Lenders tend to stick with borrowers with a DTI of under 40% </p><p><strong>Bank Account Transactions</strong></p><p>Some lenders want to see your bank account to see what money is coming in and how it’s being spent. This information provides lenders a better view of how the loan payments would affect your household’s monthly budget. </p>"
        }
    ]
}