{
  "data": [
    {
      "name": "Figure",
      "review_key": "",
      "feature": "Best for Fast Funding",
      "link": "",
      "logo": "/data/images/figure.webp",
      "upto": "",
      "introduce": "",
      "amount": {
        "min": 15000,
        "max": 400000
      },
      "rate": {
        "max": 10,
        "score": "9.9"
      },
      "compare": {
        "credit_score": "620",
        "credit_text": "",
        "apr": "Starting at 3.24%",
        "term": ""
      },
      "disclaimer": "",
      "description": "<p>Figure is an online lender that offers HELOCs. A home equity line of credit lets you tap into your home equity to access cash and can be used for purposes such as debt consolidation, home improvement or major purchases. Figure lends HELOCs in 41 states and Washington, D.C. Its rates are as low as 3.24%<sup>1</sup> APR, which includes an origination fee of up to 4.99 percent and discounts for enrolling in autopay and joining one of its partner credit unions. Its HELOC works a bit like a home equity loan in the beginning: You get the full loan amount (minus the origination fee) with a fixed rate. It then acts as a traditional HELOC in the sense that as you pay off the line of credit, you can borrow funds again up to the limit. The rate that applies to each draw is fixed at the time of the draw and won’t change over time.</p><p>While some banks and lenders have stopped offering HELOCs, Figure offers HELOC loans up to $400,000 — The amount you qualify will vary, depending on your loan-to-value ratio and credit score. There’s also an origination fee of as much as 4.99%.</p><dl><dt>Pros:</dt><dd>Funding in as few as five business days<sub>2</sub></dd><dd>Fixed interest rates</dd><dd>100% online application</dd><dd>No account opening fees, maintenance fees, or prepayment penalties</dd></dl><dl><dt>Cons:</dt><dd>Origination fees involved</dd></dl><p>Toploansadviser is a Figure partner and may receive compensation for this content.</p><p> Figure Lending LLC dba Figure | NMLS #1717824 - For licensing information, go to www.nmlsconsumeraccess.org. Equal opportunity lender</p><p>Figure Home Equity Line is available in AK, AL, AR, AZ, CA, CO, CT, DC, FL, GA, IA, ID, IL, IN, KS, LA, MA, ME, MI, MN, MO, MS, MT, NC, ND, NE, NH, NJ, NM, NV, OH, OK, OR, PA, RI, SD, TN, VA, VT, WA, WI, WY with more states to come.</p><p>For Figure Home Equity Line, APRs can be as low as 3.24% for the most qualified applicants and will be higher for other applicants, depending on credit profile and the state where the property is located. For example, for a borrower with a CLTV of 45% and a credit score of 800 who is eligible for and chooses to pay a 4.99% origination fee in exchange for a reduced APR, a five-year Figure Home Equity Line with an initial draw amount of $50,000 would have a fixed annual percentage rate (APR) of 3.24%. The total loan amount would be $52,495. Alternatively, a borrower with the same credit profile who pays a 3% origination fee would have an APR of 4.24% and a total loan amount of $51,500. Your actual rate will depend on many factors such as your credit, combined loan to value ratio, loan term, occupancy status, and whether you are eligible for and choose to pay an origination fee in exchange for a lower rate. Payment of origination fees in exchange for a reduced APR is not available in all states. In addition to paying the origination fee in exchange for a reduced rate, the advertised rates include a combined discount of 0.75% for opting into a credit union membership (0.50%) and enrolling in autopay (0.25%). APRs for home equity lines of credit do not include costs other than interest. Property insurance is required as a condition of the loan and flood insurance may be required if your property is located in a flood zone.</p><p>The Figure Home Equity Line is an open-end product where the full loan amount (minus the origination fee) will be 100% drawn at the time of origination. The initial amount funded at origination will be based on a fixed rate; however, this product contains an additional draw feature. As the borrower repays the balance on the line, the borrower may make additional draws during the draw period. If the borrower elects to make an additional draw, the interest rate for that draw will be set as of the date of the draw and will be based on an Index, which is the Prime Rate published in the Wall Street Journal for the calendar month preceding the date of the additional draw, plus a fixed margin. Accordingly, the fixed rate for any additional draw may be higher than the fixed rate for the initial draw.</p><p>For the Figure Home Equity Line, approval may be granted in five minutes but is ultimately subject to verification of income and employment. Five business day funding timeline assumes closing the loan with our remote online notary. Funding timelines may be longer for loans secured by properties located in counties that do not permit recording of e-signatures or that otherwise require an in-person closing. In addition, funding timelines may be longer if we cannot readily verify that your property is in at least average condition with no adverse external factors with a property condition report and need to order a desktop appraisal to confirm the value of your property.</p>"
    },
    {
      "name": "PenFed",
      "review_key": "",
      "feature": "Best Credit Union",
      "link": "",
      "logo": "/data/images/penfed.webp",
      "upto": "",
      "introduce": "",
      "amount": {
        "min": 25000,
        "max": 500000
      },
      "rate": {
        "max": 10,
        "score": "9.9"
      },
      "compare": {
        "credit_score": "660",
        "credit_text": "",
        "apr": "Starting at 3.75%",
        "term": ""
      },
      "disclaimer": "",
      "description": "<p>PenFed is a credit union with low entry requirements that offers many benefits to its members, from discounts to loan repayment assistance. With an APR starting at 3.75%, PenFed offers very competitive HELOC rates and allows you to take out a line of credit of up to 90% of combined loan to value. This rate puts PenFed at the top of most lists if you’re looking for the best HELOC provider out there.</p><p>Moreover, PenFed offers a repayment period of up to 20 years after a 10 year draw period. They usually cover the closing costs, as long as you don’t pay off your line of credit too fast (within three years). In that case, you will have to repay these costs. With PenFed, you can take a line of credit ranging from $25 000 to $500 000. The minimum credit score you need to have in order to qualify for a PenFed HELOC is 660.</p><dl><dt>Pros:</dt><dd>They allow you to borrow 90% CLTV</dd><dd>Flexible repayment periods.</dd></dl><dl><dt>Cons:</dt><dd>You’ll get a penalty if you pay off the HELOC too fast.</dd><dd>There are membership requirements you need to meet.</dd></dl>"
    },
    {
      "name": "TD Bank",
      "review_key": "",
      "feature": "Best for Large Home Improvement",
      "link": "",
      "logo": "/data/images/TD-Bank.png",
      "upto": "",
      "introduce": "",
      "amount": {
        "min": 25000,
        "max": 500000
      },
      "rate": {
        "max": 10,
        "score": "9.9"
      },
      "compare": {
        "credit_score": "620",
        "credit_text": "",
        "apr": "Starting at 3.54%",
        "term": ""
      },
      "disclaimer": "",
      "description": "<p>Although the HELOCs provided by TD Bank are only available in 15 states on the East Coast along with Washington D.C., we had to include them on the list. The best thing about TD Bank’s HELOCs is that there is no minimum draw and they offer credit lines between $25 000 and $500 000, which makes them a great choice if you need to fund large home improvement projects.</p><p>TD Bank allows you to lock in a fixed interest rate so you don’t have to worry about market fluctuations. Their APRs differ depending on your location but they start at 3.54%, which is an incredibly competitive rate. It’s important to mention that TD Bank does have an annual fee of $50 and an origination fee of $99 if you take out $50 000 or more.  If you pay off your HELOC within two years, you will be charged a penalty of 2% of the entire amount. The minimum credit score for these HELOCs is 620.</p><dl><dt>Pros:</dt><dd>Great customer service</dd><dd>Ability to lock in fixed rates</dd><dd>Competitive interest rates</dd></dl><dl><dt>Cons:</dt><dd>There’s a number of fees involved</dd><dd>Limited availability based on location</dd></dl>"
    },
    {
      "name": "PNC Bank",
      "review_key": "",
      "feature": "Best for Small Home Improvement",
      "link": "",
      "logo": "/data/images/PNC-Bank.png",
      "upto": "",
      "introduce": "",
      "amount": {
        "min": 10000,
        "max": 500000
      },
      "rate": {
        "max": 10,
        "score": "9.9"
      },
      "compare": {
        "credit_score": "620",
        "credit_text": "",
        "apr": "7.19% - 9.05%",
        "term": ""
      },
      "disclaimer": "",
      "description": "<p>Last but not least is the PNC bank, which is the best option for those looking to make small home improvement projects. The minimum amount you can borrow is $10 000 and you only pay interest on what you spend. However, you still get access to the funds throughout the entire draw period. The PNC Bank’s APRs range between 7.19% and 9.05%, along with the ability to choose a repayment period between 5 and 30 years.</p><p>The PNC Bank also offers users to convert their HELOCs to a fixed rate but each conversion comes with a $100 transfer fee. On the bright side, there is no application fee but you will have to pay an annual fee of $50. If you own a PNC checking account, you will receive a 0.25% rate discount as a part of their loyalty program. This option requires you to have a credit score of at least 620.</p><dl><dt>Pros:</dt><dd>Low minimum loan amount</dd><dd>The ability to switch to fixed rates</dd></dl><dl><dt>Cons:</dt><dd>Several fees involved</dd></dl>"
    }
  ]
}
