{
  "data": [
    {
      "name": "Veterans United Home Loans",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/veterans-united-home-loans.jpg",
      "score": "9.8",
      "feature": "Best Overall",
      "slogan": "1 Application, Several Offers",
      "advantage": [
        {
          "text": "Compare rates in minutes"
        },
        {
          "text": "Easy process, 100% online"
        },
        {
          "text": "Secured website with data encryption"
        }
      ],
      "credit_score": "580-620",
      "down_payment": "0%-3.5%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "VA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Veterans United Home Loans is considered amongst the top five VA lenders in the United States. This is because it provides various loan products to military personals that include veterans across the country. </p><p>The company also has a counselling scheme free of cost that provides potential customers with tips on how to improve their credit scores. That is mainly why it is considered the best overall loan in the industry.</p><dl><dt>There are several advantages of going with Veteran United. They are as follows:</dt><dd>They have an around the clock customer service.</dd><dd>Free credit counselling by experts for those people that cannot maintain the required credit score.</dd><dd>With an A+ rating from BBB, it ensures reliability and efficiency.</dd><dd>The application process takes place on their online platform, bringing convenience and accessibility.</dd></dl><dl><dt>The disadvantages to selecting Veteran United consists of the following</dt><dd>There are no home equity offerings or lines of credit.</dd><dd>There are physical locations but are available in select states only.</dd><dd>They charge relatively higher fees and rates.</dd></dd></dl><p>The company also offers conventional loans, FHA loans, USDA loans, and jumbo loans. In the case of VA loan products, the company offers VA loans for purchases, VA jumbo loans, and VA cash-out loans, VA refinancing mortgages, and VA energy-efficient mortgages as part of their loan product range.</p><p>Note: The minimum criteria to qualify for a VA loan under this company is set at a 640 credit score as per the FICO scale, with zero down payments required.</p>"
    },
    {
      "name": "Loan Depot Mortgage",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/loan-depot-logo.png",
      "score": "9.7",
      "feature": "Best For Fast Funding",
      "slogan": "A+ Customer Satisfaction",
      "advantage": [
        {
          "text": "35 years of experience"
        },
        {
          "text": "Fully automated, online process"
        },
        {
          "text": "Pre-approval available"
        }
      ],
      "credit_score": "620",
      "down_payment": "3%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Loan Depot is labelled as amongst the biggest loan providers in the mortgage market. The company has a user-friendly online platform that makes it the best online lender in the industry. So the company is perfect for individuals who are comfortable with the online experience to apply for a mortgage. </p><p>Also, Loan Depot offers face to face interaction with its employees in the customer care department to assist the customers in the application process. But the brick and mortar stores are available in the United only in selective areas.</p><dl><dt>The benefits of choosing Loan Depot are</dt><dd>Existing customers seeking refinancing mortgages will waive fees such as lenders, appraisals, etc.</dd><dd>There are over 200 physical locations for those customers that want to visit the office personally and apply in person.</dd><dd>There is an option to carry out the entire application process through Mello smartloan platform.</dd></dl><dl><dt>The downsides to applying with Loan Depot are</dt><dd>There are no home equity offerings or lines of credit.</dd><dd>There isn't much information available online regarding fees and rates.</dd><dd>The lender does not offer USDA loans.</dd></dl><p>Loan Depot offers different kinds of loans that consist of conventional loans, jumbo loans, FHA loans, fixed and adjustable-rate loans, construction and renovation loans, and refinancing mortgages.</p><p>Note: The minimum credit requirement for VA loans is 620 as per the FICO scale, which would account for the company's 3.5% minimum down payment.</p>"
    },
    {
      "name": "Pentagon Federal Credit Union",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/pentagon-federal-credit-union.jpg",
      "score": "9.5",
      "feature": "Best For Online Mortgage Refinancing",
      "slogan": "No Login/Registration Required",
      "advantage": [
        {
          "text": "Has funded over $65 billion in home loans"
        },
        {
          "text": "Clearance in as little as 8 days"
        },
        {
          "text": "Mello smartloan™ digital asset verification"
        }
      ],
      "credit_score": "580-620",
      "down_payment": "3.5%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "VA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>PenFed is a credit card company that is specific for its members only. To become a member, a person needs to belong to a military family, have an affiliation to military personal, or be working as a federal employee. </p><p>There is an exception where people who do not follow in any of the above categories become members if they have donated money to military-related nonprofit organizations. The company is widely known for its 30-year term mortgage and is considered the best in this category.</p><dl><dt>The following are the pros to applying for VA loans through PenFed</dt><dd>The company charges no lender fees.</dd><dd>The company offers various discounts in auto, finance, and home personal.</dd><dd>The application platform involves an online process that is simple and easily accessible through mobile phones.</dd></dl><dl><dt>The drawbacks related to PenFed for VA loans are</dt><dd>The company charges some fees except the lenders' fees like VA funding fees, title fees, appraisal fees, and tax services fees.</dd><dd>The company does not accept the alternative source of credit data such as utility bills.</dd><dd>There are minimal numbers of physical stores available across the USA.</dd><dd>A person needs to become a member to be eligible to apply for the VA loan.</dd></dl><p>The various loan products offered by PenFed consist of vehicle loans, student loans, mortgage refinancing, home loans and VA loan offerings.</p><p>Note: The credit requirement for PenFed stands at 620 on the FICO scale, with zero down payments in the case of VA loans.</p>"
    },
    {
      "name": "Navy Federal Credit Union",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/navy-federal-credit-union.jpg",
      "score": "9.2",
      "feature": "Best Marketplace",
      "slogan": "Unlock Your Financial Potential",
      "advantage": [
        {
          "text": "Provides great refinancing calculators"
        },
        {
          "text": "An all-digital app, no hassle"
        },
        {
          "text": "Dedicated support team"
        }
      ],
      "credit_score": "580-680",
      "down_payment": "3.5%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "VA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Navy Federal Credit Union is considered as amongst the top VA lenders in the States that offers a wide variety of loan products. The credit union is known to be the best in the category of 15-year term loans. </p><p>The company provides some of the competitive VA loan rates in the industry as opposed to their competitors. The credit union is a member-only company where military personals, veterans and their families can open a savings account and apply for loans.</p><dl><dt>The following are the benefits of applying for a VA loan under Navy Federal</dt><dd>No down payment is required.</dd><dd>It offers a mortgage with zero premium mortgage insurance.</dd><dd>No fee will be charged on loan processing.</dd><dd>The company also offers a rate match guarantee that pays $1000 upon closing.</dd><dd>It provides services up to 100% financing.</dd></dl><dl><dt>The drawbacks to applying with Navy Federal for VA loans are:</dt><dd>The in-person stores are fewer in number, thus restricting the customer base that wishes to apply face to face.</dd><dd>The company is specific to members only, so not everyone can become a member and apply for loans.</dd><dd>The mobile application has some technical issues and even lags at times.</dd></dl><p>The company also offers conventional loans and jumbo loans, interest-only loans for a 15-year term and 30-year term. In the case of VA loans, the loan offerings include VA loans for purchases, VA refinancing mortgages, and Military choice loans.</p><p>Note: The minimum credit score requirement as per the FICO scale is 580, and no down payment is required.</p>"
    }
  ]
}
