{
  "data": [
    {
      "name": "Rocket Mortgage",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/rocket-mortgage-logo.png",
      "score": "9.8",
      "feature": "Best Overall",
      "slogan": "1 Application, Several Offers",
      "advantage": [
        {
          "text": "Compare rates in minutes"
        },
        {
          "text": "Easy process, 100% online"
        },
        {
          "text": "Secured website with data encryption"
        }
      ],
      "credit_score": "580-620",
      "down_payment": "0%-3.5%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "VA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Rocket mortgage, which is an affiliate of Quicken Loans, is considered the leading mortgage company in the United States. </p><p>It is famous for being ranked first place in the US with its state of the art customer service platform that brings convenience to first-time borrowers. And merely that is why it is known as the best overall loan for anyone seeking a mortgage.</p><p>Rocket mortgage provides people with a variety of loan products to choose from. Among those loan products, they also offer <strong>FHA mortgage loans</strong> to people seeking a simple financing process that is effective and efficient.</p><p>Federal Housing Administration approves rocket mortgage to provide FHA loan offerings to customers. These loan offerings come with low credit and down payment requirements for first-time borrowers. </p><p>Whereas for returning customers, the FHA refinancing scheme offers flexibility along with streamlining the entire process with efficiency. Moreover, the company does not ask for any appraisal requirements, which is a plus.</p><dl><dt>The advantages to choosing Rocket mortgage include:</dt><dd>An online application process that is simple to use and easy to understand even for first-timers.</dd><dd>The loan approval time is very efficient, and it gets approved within a few minutes duration.</dd><dd>A reputable loan provider that can be trusted.</dd><dd>A large quantity of loan applications ensures consistency, availability and assurance.</dd><dd>The best customer satisfaction platform in the market.</dd><dd>Easy accessibility all across the United States.</dd></dl><dl><dt>The disadvantages to selecting Rocket mortgage are:</dt><dd>There are no physical or in-person stores.</dd><dd>Credit data is only acceptable from the three major credit bureaus.</dd><dd>The loan provider fee is relatively high.</dd></dl><p>Note: The minimum credit score asked by the lender for an FHA loan is 580 with a 3.5% down payment. So a borrower needs to fulfil the minimum criteria to be considered a candidate for FHA loans by Rocket mortgage.</p><p>Apart from providing FHA loan offerings, there are several other loan products that can be availed from the company. <strong>They merely include conventional loans, jumbo loans, VA loans and refinancing mortgages</strong>.</p>"
    },
    {
      "name": "Carrington Mortgage",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/carrington-mortgage.jpg",
      "score": "9.7",
      "feature": "Best For Fast Funding",
      "slogan": "A+ Customer Satisfaction",
      "advantage": [
        {
          "text": "35 years of experience"
        },
        {
          "text": "Fully automated, online process"
        },
        {
          "text": "Pre-approval available"
        }
      ],
      "credit_score": "620",
      "down_payment": "3%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Carrington Mortgage, which the Carrington Holding Company owns, is one of the biggest loan providers in the industry. The company is widely considered the first choice for people with a poor credit line. </p><p>Those individuals who have faced certain challenges with their credit score in the past can surely consider applying for a loan with the Carrington mortgage.</p><p>Carrington Mortgage is a licensed mortgage lender by the Federal Housing Administration that offers a variety of loan options from which the borrowers could choose. Some leading loan offerings by this company include <strong>FHA financing loans for purchases</strong>, FHA cash-out loans, and FHA refinancing mortgages, all in a streamlined process.</p><dl><dt>The benefits to applying for Carrington mortgage consists of:</dt><dd>Credit data is acceptable from alternative sources other than the major credit bureaus.</dd><dd>Provide loans to borrowers with less than average credit scores.</dd><dd>A large number of stores in the United States, thus bringing easy accessibility and availability.</dd><dd>It offers a first-time homebuyer program for new customers.</dd><dd>Non-traditional financing is acceptable such as utility bills instead of the credit report.</dd><dd>Non-traditional financing is acceptable such as utility bills instead of the credit report.</dd><dd>The BBB rating brings reliability and performance.</dd></dl><dl><dt>The drawbacks to choosing a Carrington mortgage include:</dt><dd>The application process does not have an online platform, so customers need to visit physical stores.</dd><dd>There is no home equity or lines of credit offers.</dd><dd>A deductible fee of $5 when the mortgage is paid through the website or the official app of the company.</dd><dd>Personalized rates are not available on the website or the app. Hence, customers need to either visit the brick or mortar stores or speak to their loan officer.</dd></dl><p>Apart from providing FHA loan products, the company also provides several other loan offerings like conventional loans, VA loans, USDA loans and refinancing mortgages.</p><p>Note: The minimum credit score requirement for FHA loans that are set by <strong>Carrington mortgage</strong> is 500 along with a 3.5% down payment. The low credit criteria give an option to those people that have a credit score in the 500s.</p>"
    },
    {
      "name": "Chase Mortgage",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/chase-mortgage.jpg",
      "score": "9.5",
      "feature": "Best For Online Mortgage Refinancing",
      "slogan": "No Login/Registration Required",
      "advantage": [
        {
          "text": "Has funded over $65 billion in home loans"
        },
        {
          "text": "Clearance in as little as 8 days"
        },
        {
          "text": "Mello smartloan™ digital asset verification"
        }
      ],
      "credit_score": "580-620",
      "down_payment": "3.5%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "VA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Chase is widely known as one of the largest national banks in the United States of America that have in-person stores throughout the country. The company is considered an ideal choice in the category of best traditional lenders. The reason is that it offers a whopping $2500 to $5000 grant to those customers that are willing to accept the FHA loans under the Chase DreaMaker program.</p><p>The company has nearly five thousand stores around the US, which makes it convenient and accessible for people to visit and apply for mortgages. The company also has invested in their online platform, giving customers an ideal experience if they choose to apply online through the company's official website or mobile app.</p><p>Chase mortgage is perfect for the citizens of the USA provided that they are first time customers for the bank. This would open several loan offers for them that have a small down payment and closing cost attached to it.</p><dl><dt>The benefits to select Chase mortgage include:</dt><dd>A large number of stores that provide face to face customer support.</dd><dd>A $2500 to $5000 grant was given to the customer through one of its programs at the time of closing.</dd><dd>The mortgage company charges a lower interest rate.</dd><dd>Lower down payment cost.</dd><dd>Loans granted to customers with zero PMI.</dd></dl><dl><dt>The downsides to choosing a Chase mortgage are:</dt><dd>The grant given to customers cannot be used to pay off the down payment cost.</dd><dd>Borrowers need to have a good credit score to apply for the loan.</dd><dd>There are no home equity offerings or lines of credit.</dd></dl><p>Customers can choose from a variety of loan products apart from FHA loan offerings that include conventional loans, VA loans, Jumbo loans, and interest-only loans. Depending upon their preference, customers can opt for any of these loans.</p><p>Note: The minimum credit score requirement stands at 640 as per the FICO scoring model. Borrowers would also need to pay a 3.5% down payment.</p>"
    },
    {
      "name": "Caliber Home Loans",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/caliber-home-loans.jpg",
      "score": "9.2",
      "feature": "Best Marketplace",
      "slogan": "Unlock Your Financial Potential",
      "advantage": [
        {
          "text": "Provides great refinancing calculators"
        },
        {
          "text": "An all-digital app, no hassle"
        },
        {
          "text": "Dedicated support team"
        }
      ],
      "credit_score": "580-680",
      "down_payment": "3.5%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "VA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Caliber home loans are a good fit for first-time borrowers, military personals, and any other person seeking to get a loan efficiently. Caliber offers a user-friendly technology that makes the application process easy to understand. </p><p>Caliber also provides potential customers with an in-house council consisting of professional loan consultants to help streamline the process. Caliber comes with a low down payment cost, which helps relieve some financial burden on the customers.</p><dl><dt>The following pros allow customers to make the right decision by choosing Caliber:</dt><dd>It offers a wide variety of loan offerings for customers to choose from.</dd><dd>The entire application process is streamlined through the online platform.</dd><dd>The mobile app provides the users with simplicity and convenience to pay the mortgage.</dd><dd>It offers different loan options for military personnel and has a separate website</dd><dd>In-house services include first time home buyer programs with easy criteria for eligibility.</dd></dl><dl><dt>The drawback for Caliber loans are:</dt><dd>The website does not have enough information regarding rates charged.</dd><dd>There are no home equity offerings or lines of credit.</dd><dd>Only accepts credit data from a trusted source like major credit bureaus.</dd></dl><p>The company provides various loan products such as conventional loans, VA loans for military personals, USDA loans, refinancing a mortgage, renovation and construction loans, and FHA loans.</p><p>Note: The minimum credit score requirement set by Caliber Home Loans is 620 for conventional loans and 580 for FHA or VA loans. The down payment is somewhere between 0% to 3% of the loan cost.</p>"
    }
  ]
}
