{
  "data": [
    {
      "name": "Rocket Mortgage",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/rocket-mortgage-logo.png",
      "score": "9.8",
      "feature": "Best Overall",
      "slogan": "1 Application, Several Offers",
      "advantage": [
        {
          "text": "Compare rates in minutes"
        },
        {
          "text": "Easy process, 100% online"
        },
        {
          "text": "Secured website with data encryption"
        }
      ],
      "credit_score": "580-620",
      "down_payment": "0%-3.5%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "VA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Rocket mortgage is a type of loan offered by Quicken Loans, known as one of the largest loan companies in the United States. The company has a good reputation for helping out a large proportion of people buying their dream property.</p><p>Rocket mortgage is considered the best overall loan. This is because the online application process is easy and simple to understand. Moreover, the company witnessed the lowest complaints from their users, which is a good sign. </p><p>The company also offers various loan products, including refinance loans at a reasonable cost. Lastly, the company is quite transparent about rates and fees for the loans it offers. And they are easily accessible on the company's website.</p><p>Note: To qualify for a Rocket mortgage, an individual should have a minimum credit score of 620 as per the FICO scale.</p><p>There are different types of loans that people can apply for, including conventional loans, cash-out loans, VA loans, and FHA loans.</p><dl><dt>The reasons why people should opt for Rocket mortgage consists of:</dt><dd>There are different types of loans to choose from.</dd><dd>With its BBB rating, reliability and performance can be trusted.</dd><dd>For over a decade, it has been consistently ranked as the top loan provider in the USA.</dd><dd>It provides an efficient and effective online experience to its customers.</dd></dl><dl><dt>Rocket mortgage has the following drawbacks:</dt><dd>It cannot be refinanced into a USDA loan.</dd><dd>Reliable credit data from the major credit bureaus is acceptable only. So it does not accept data from any other source.</dd></dl>"
    },
    {
      "name": "Better Mortgage",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/better-logo.png",
      "score": "9.7",
      "feature": "Best For Fast Funding",
      "slogan": "A+ Customer Satisfaction",
      "advantage": [
        {
          "text": "35 years of experience"
        },
        {
          "text": "Fully automated, online process"
        },
        {
          "text": "Pre-approval available"
        }
      ],
      "credit_score": "620",
      "down_payment": "3%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Better mortgage is an online mortgage company that provides people with a completely online experience to buy loans with an outstanding customer service department to help its customers.</p><p>Better mortgage is considered the loan for fast closing time. It has several money-saving incentives that give it an edge over its competitors. Moreover, the application platform is very user-friendly, allowing people to get pre-approval on their loans efficiently.</p><p>The company does not provide different types of loans instead of its competitors within the industry. But it does offer several customer incentives that are in the people's interest. The company's information for the loans and products it offers is available on the company website.</p><p>The reviews given by the customers are always in a positive light, with only one complaint per thousand loans, which signifies a lower than average rate of complaining.</p><p>The different types of loans offered by Better include purchase loans, jumbo loans, refinance loans, fixed loans, and adjustable loans.</p><dl><dt>Better mortgage has the following pros:</dt><dd>The application process is entirely online, with minimal human help needed.</dd><dd>An online platform makes it convenient for customers to seek mortgage rates that suit them the best.</dd><dd>The decision to a pre-approval loan is given in less than a day.</dd><dd>The appraisal insurance ensures that there will be no effect on the loan if the appraisal is less than what they perceived.</dd><dd>The company does not charge any commission or fee.</dd><dd>The company does accept the alternative source of credit data like utility bills.</dd></dl><dl><dt>The cons for Better mortgage include:</dt><dd>Due to its limited loan products range, people cannot opt for home equity loans.</dd><dd>The company does not offer different loan types like VA or FHA loans.</dd><dd>The appraisal insurance is restricted to those customers that use Better real estate agents.</dd><dd>The company does not have a brick-and-mortar building to reach out to.</dd></dl>"
    },
    {
      "name": "Loan Depot",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/loan-depot-logo.png",
      "score": "9.5",
      "feature": "Best For Online Mortgage Refinancing",
      "slogan": "No Login/Registration Required",
      "advantage": [
        {
          "text": "Has funded over $65 billion in home loans"
        },
        {
          "text": "Clearance in as little as 8 days"
        },
        {
          "text": "Mello smartloan™ digital asset verification"
        }
      ],
      "credit_score": "580-620",
      "down_payment": "3.5%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "VA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Loan Depot is one of the top-rated mortgage companies in the industry, offering various types of loans that include purchase loans, renovation loans, etc. However, the company is well known to be a non-bank loan provider with regional brick and mortar offices to attract customers and aid them in terms of the mortgage. </p><p>The company has spent a good amount of money on upgrading its online platform to bring user-friendly technology in place.</p><p>Loan Depot offers several loan products that include purchase loans that can be bought at an adjustable fixed interest rate. Moreover, the company also offers jumbo loans, VA loans, FHA loans, etc.</p><p>Note: To qualify for Loan Depot, a person must have a minimum credit score of 620, and a 5% down payment is mandatory.</p><dl><dt>Loan Depot has the following pros:</dt><dd>Customers can opt for in-person interaction by going to the physical stores.</dd><dd>They provide VA and FHA loans and are considered the leading loan providers for such loans.</dd><dd>They provide digital income, assets, and employment verification.</dd></dl><dl><dt>Cons include the following:</dt><dd>The loan rates for different types of mortgages are not available online, so the customer needs to contact the loan provider.</dd><dd>They do not provide home equity or lines of credit.</dd><dd>They do not provide Rural Development Loans, which decreases the customer base.</dd></dl>"
    },
    {
      "name": "Zillow",
      "link": "",
      "logo": "/data/images/best-mortgage-refinance-lenders/zillow-logo.png",
      "score": "9.2",
      "feature": "Best Marketplace",
      "slogan": "Unlock Your Financial Potential",
      "advantage": [
        {
          "text": "Provides great refinancing calculators"
        },
        {
          "text": "An all-digital app, no hassle"
        },
        {
          "text": "Dedicated support team"
        }
      ],
      "credit_score": "580-680",
      "down_payment": "3.5%",
      "loan_types": [
        {
          "text": "Conventional"
        },
        {
          "text": "FHA"
        },
        {
          "text": "VA"
        },
        {
          "text": "Jumbo"
        }
      ],
      "description": "<p>Zillow Home Loans is directly affiliated with the Zillow Group and provides a wide variety of mortgages from its online platform. The company does not have any physical stores, so the majority of operations run through its online platform.</p><p>Though the company has limited loan options, it does provide competitive rates on purchase loans and refinance mortgages in the market. The loan can be granted within 48 hours, and the loan period does not extend beyond the 40 days radius.</p><p>Zillow is perfect for people who find the online experience of doing business convenient and simple. With its online platform, borrowers can also get several discounts.</p><p>Zillow's different type of mortgage includes conventional loan, FHA and VA loans, and Jumbo loans with a fixed rate.</p><p>Note: Although Zillow does not have any minimum credit requirement, it does come with a 3% monthly down payment.</p><dl><dt>Pros include the following:<dt><dd>The company provides a loan officer to the borrower to streamline the entire process.</dd><dd>Online resources are available through its online platforms, such as a mortgage calculator and checklist needed for the loans.</dd><dd>Offers discounts to borrowers on their loans.</dd><dd>The interest rates are competitive.</dd></dl><dl><dt>Drawbacks consist of:<dt><dd>The closing of a loan might take up some time.</dd><dd>Borrowers cannot apply for the loan face to face</dd><dd>Borrowers cannot check or confirm their loan status through the company's app</dd><dd>The rates for the loans are not available on their online platform</dd></dl>"
    }
  ]
}
