{
    "data": [
        {
            "title": "Representative Example",
            "content": "<p>Assuming a loan of $5,000 over 36 months at a fixed rate of 10.5% per annum and fees of $60.00.</p><p>This would result in a representative rate of 11.3% APR, with monthly repayments of $162.51, for a total amount paid of $5,910.44.</p>"
        },
        {
            "title": "What is the average interest rate on a personal loan?",
            "content": "<p>Different lenders charge different rates, which can range from less than 3% to more than 36%. Personal loans are generally associated with lower interest rates for those who have higher credit scores.</p>"
        },
        {
            "title": "I have bad credit – can I still get a personal loan?",
            "content": "<p>Yes, though there are limited options. If you need money fast, you might wish to consult with a bad credit lender, a credit builder or an alternative lender that doesn't just look at your credit score. You may also be able to search for lower interest rates and flexible credit requirements by looking into local credit unions or local banks. </p>"
        },
        {
            "title": "How do you get an unsecured loan?",
            "content": "<p>Under unsecured loans, also known as signature loans, no collateral is needed. The amount varies depending on how creditworthy you are. The better your credit score, the better the rate. In order to apply for an unsecured loan you normally need proof of income, residency in the United States, and a Social Security number.</p>"
        },
        {
            "title": "What is APR*? What's the difference between the interest rate and the APR?",
            "content": "<ul style=\"list-style: disc;\"><li style=\"margin-bottom: 15px;\">The interest rate charged on a personal loan is referred to as APR, or annual percentage rate. The APR numbers can differ, but they will always have a maximum of 35.99%. APRs usually range from 5% to 30% with online lenders. Different factors like credit score, income, and financial history will determine the APR of your loan. The quoted APR includes any related fees.</li><li style=\"margin-bottom: 15px;\">You pay interest if you borrow money from a lender. Since the APR includes all fees as well as the interest rate, the APR is an accurate representation of the cost of the loan.</li></ul>"
        },
        {
            "title": "Are personal loans bad for your credit?",
            "content": "<p>Loans for personal use generally don't harm your credit score. The credit score can actually be improved by a personal loan as long as you make regular payments and pay within the loan's terms. </p>"
        },
        {
            "title": "Can I take out a personal loan to invest?",
            "content": "<p>You can do that, but maybe not for the best. Borrowing money on a personal loan is already incredibly risky in its own right. It takes a long time to get to the level of skilled investors who take loans out on personal terms. Sometimes even these people don’t succeed.</p>"
        },
        {
            "title": "How quickly can I be approved for a personal loan?",
            "content": "<p>Occasionally lenders allow you to apply by a certain cutoff time, and your application may be approved the next business day. This may delay the process a few days if extra verification is needed or if you are required to visit a branch location. Usually, the lender will let you know the turnaround time upfront.</p>"
        },
        {
            "title": "For my personal loan application, what do I need？",
            "content": "<p>It's much easier than you'd think to apply for a personal loan. The applications usually do not require much information about you and require just a couple of minutes to complete. Typically, loan applications ask for your name, address, phone number, AND basic information about your credit history, your income, and your financial history.</p>"
        },
        {
            "title": "How much do personal loans cost?",
            "content": "<p>Three main factors contribute your loan’s cost:</p><p><br></p><ul style=\"list-style: disc;\"><li style=\"margin-bottom: 15px;\"><strong>Interest rate. </strong>This is what the lender charges you to borrow money. It’s a percentage of the loan amount that typically ranges from 5% to 36%. Lenders can’t charge over 36% APR.</li> <li style=\"margin-bottom: 15px;\"><strong>Fees. </strong>It’s common to see origination fees up to 5% of the loan amount. Other common personaal loan fees include prepayment penalties if you plan to pay your loan off early. Lenders may also charge for late or missed payments and unsuccessful or failed payments.</li><li style=\"margin-bottom: 15px;\"><strong>Loan term.</strong> Your loan term is how long you have to pay off a loan. Most lenders offer terms between 3 and 7 years. The longer your loan term, the more you pay in interest. But while you’ll pay less with a shorter term, your monthly payments could be much higher.</li></ul>Your annual percentage rate (APR) is an expression of your interest rate and fees as a percentage. APR can give you an idea of how much it will cost each year you take to pay back your loan. It doesn’t include late fees, nonsufficient funds fees (NSF) or prepayment penalties.<p><br></p>"
        }
    ]
}