{
    "data": [
        {
            "title": "Here is one example",
            "content": "<p>Let’s say you have an annual interest rate of 10.5% on a loan of $5,000 over 36 months, as well as $60 in fees. With a representative APR of 11.3%, and monthly repayments of $162.51, the total amount repaid would be $5,910.44.</p>"
        },
        {
            "title": "How much does a personal loan cost on average?",
            "content": "<p>Different lenders charge different rates, which can range from less than 3% to more than 36%. Personal loans are generally associated with lower interest rates for those who have higher credit scores.</p>"
        },
        {
            "title": "Do I qualify for a personal loan even though I have bad credit?",
            "content": "<p>Yes, though there are limited options. If you need money fast, you might wish to consult with a bad credit lender, a credit builder or an alternative lender that doesn't just look at your credit score. You may also be able to search for lower interest rates and flexible credit requirements by looking into local credit unions or local banks.</p>"
        },
        {
            "title": "How are unsecured loans obtained?",
            "content": "<p>Under unsecured loans, also known as signature loans, no collateral is needed. The amount varies depending on how creditworthy you are. The better your credit score, the better the rate. In order to apply for an unsecured loan you normally need proof of income, residency in the United States, and a Social Security number.</p>"
        },
        {
            "title": "How does APR work? Are interest rates and APR the same thing?",
            "content": "<ul style=\"list-style: disc;\"><li style=\"margin-bottom: 15px;\">The interest rate charged on a personal loan is referred to as APR, or annual percentage rate. The APR numbers can differ, but they will always have a maximum of 35.99%. APRs usually range from 5% to 30% with online lenders. Different factors like credit score, income, and financial history will determine the APR of your loan. The quoted APR includes any related fees.</li><li style=\"margin-bottom: 15px;\">You pay interest if you borrow money from a lender. Since the APR includes all fees as well as the interest rate, the APR is an accurate representation of the cost of the loan.</li></ul>"
        },
        {
            "title": "What are the effects of personal loans on your credit score?",
            "content": "<p>Loans for personal use generally don't harm your credit score. The credit score can actually be improved by a personal loan as long as you make regular payments and pay within the loan's terms.</p>"
        },
        {
            "title": "Would a personal loan be available for investing?",
            "content": "<p>You can do that, but maybe not for the best. Borrowing money on a personal loan is already incredibly risky in its own right. It takes a long time to get to the level of skilled investors who take loans out on personal terms. Sometimes even these people don’t succeed.</p>"
        },
        {
            "title": "Could I receive a personal loan quickly?",
            "content": "<p>Occasionally lenders allow you to apply by a certain cutoff time, and your application may be approved the next business day. This may delay the process a few days if extra verification is needed or if you are required to visit a branch location. Usually, the lender will let you know the turnaround time upfront.</p>"
        },
        {
            "title": "For my personal loan application, what do I need?",
            "content": "<p>It's much easier than you'd think to apply for a personal loan. The applications usually do not require much information about you and require just a couple of minutes to complete. Typically, loan applications ask for your name, address, phone number, AND basic information about your credit history, your income, and your financial history.</p>"
        },
        {
            "title": "What is the cost of personal loans?",
            "content": "<p>TYour loan’s cost is determined by three primary factors:</p><p><br></p><ul style=\"list-style: disc;\"><li style=\"margin-bottom: 15px;\"><strong>Interest rate. </strong>To borrow money from the lender, they charge you interest. It is typically between 5% and 36% of the loan amount. No lender can charge more than a 36% APR.</li> <li style=\"margin-bottom: 15px;\"><strong>Fees. </strong>Fees for this type of loan can range from 1% to 5%. Prepayment penalties may also apply to personal loans that are paid off early. For late payments and unsuccessful payments, lenders are allowed to charge interest as well.</li><li style=\"margin-bottom: 15px;\"><strong>Loan term.</strong> This is the duration of your repayment of a loan. The lending terms of most lenders range from 3 to 7 years. You pay more interest if you have a longer-term loan. However, you’ll pay much more each month with short-term loans.</li></ul>You can depict the interest rate and fees you owe as a percentage of your annual percentage rate (APR). In other words, APR lets you know how much you'll have to pay every year until your loan is repaid. The amount does not include late fees, nonsufficient funds fees (NSF), or prepayment penalties.<p><br></p>"
        }
    ]
}