{
    "data": [
        {
            "title": "Are Private Student Loans Worth Applying For To Fund Your Education",
            "content": "<p style=\"margin-bottom: 15px;\">When you choose to attend college, you know that the cost will be exorbitantly high. You have to find ways to pay for the costs, such as scholarships, grants and loans. If you’ve got the maximum in grants and don’t qualify for scholarships, you may still not have enough. If this is the case for you, you may want to look at private student loans. </p><p style=\"margin-bottom: 15px;\">Private student loans differ from federal student loans, as financial institutions and private lenders finance these loans. They also use their credit score and creditworthiness to determine if you are eligible for a loan. On top of that, the repayment terms are less than ideal, and a co-signer may be necessary. </p><p style=\"margin-bottom: 15px;\">Think of private student loans like personal loans.  They are there to close the gaps of school costs federal loans do not. </p>"
        },
        {
        "title": "Private Student Loan Qualifications",
        "content": "<p style=\"margin-bottom: 15px;\">Eligibility of a private student loan will depend on your creditworthiness and that of your co-signer (if applicable). Each lender has a set of eligibility requirements, including credit score and minimum income. You may also be asked if you are a citizen of the U.S. or a permanent resident. The lender may also require that you attend an approved school on their list. </p>"
        },
        {
        "title": "Is A Co-Signer Necessary?",
        "content": "<p style=\"margin-bottom: 15px;\">Most private student loan lenders will require you to have a co-signer. This is especially true if your credit history is negligible or non-existent. A co-signer, such as a parent or relative, may also help you attain a better interest rate. </p><p style=\"margin-bottom: 15px;\">Some lenders will relieve a co-signer of the debt obligation if you have maintained a good loan repayment history. This can be seen in as little as one year to as much as four years. However, it’s only approved if you can meet their credit and income requirements. </p>"
        },
        {
            "title": "Private Student Loan Application Process ",
            "content": "<p style=\"margin-bottom: 15px;\">Before you attempt to apply for any private student loan, review your credit and learn your credit score. Private student loan lenders tend to offer loans to those with a high credit score or a demonstrated history of repayment. If your credit is less than ideal, find a person whose credit is good and ask them to be a co-signer for the loan. </p><p style=\"margin-bottom: 15px;\">Your application will also need certain documents attached to it:</p><ul style=\"list-style: disc;margin-bottom: 15px;\"><li>Birthdate, aliress and other identifying information</li><li>Social security number</li><li>Paystubs</li><li>Monthly mortgage or rent receipts</li><li>Proof of assets </li></ul><p style=\"margin-bottom: 15px;\">You must also fill out the Private Education Loan Applicant Self-Certification form the school provides, so the lender will know how much the cost will be for you to attend the institute.</p><p style=\"margin-bottom: 15px;\">Make sure to get a reasonable estimate of how much money is necessary to attend the university and ask for that amount.  If you need a little extra for housing and books, go ahead and include it.  Remember, knowing what you need now will affect how small or big a loan you will need.</p>"
        }
    ]
}